{
    "link": "https://www.wikihow.com/Fix-iPhone-Unavailable-Screen",
    "article": "How to Fix the “iPhone Unavailable” Message: Explanation and Fixes",
    "intro": "The “iPhone Unavailable” screen appears when the lock passcode has been entered incorrectly too many times. Each subsequent failed attempt increases the amount of time before you can try again. After 10 attempts, the iPhone will need to be reset. This wikiHow shows you how to fix the unavailable screen on an iPhone.",
    "points": [
        {
            "name": "What does \"iPhone Unavailable\" mean?",
            "steps": [
                {
                    "step": "None",
                    "title": "“iPhone Unavailable” is your iPhone’s Security Lockout.",
                    "subtitle": " If the passcode to  is entered incorrectly five times, the “iPhone Unavailable” screen will appear with a message that says “try again in 1 minute.”",
                    "sub-points": [
                        "The amount of time between attempts will increase with each incorrect passcode.After 6 attempts, you'll see \"iPhone Unavailable, try again in 5 minutes.\"After 7 attempts, you'll see \"iPhone Unavailable, try again in 15 minutes.\"After 8 and 9 attempts, you'll see \"iPhone Unavailable, try again in 60 minutes.\"After 10 attempts, you'll see \"iPhone Unavailable,\" with no timer. At this point, the iPhone will need to be restored. It can no longer be unlocked.",
                        "If you previously selected “Erase Data” in your passcode settings, the iPhone’s data will be erased automatically."
                    ]
                },
                {
                    "step": "None",
                    "title": "“iPhone Unavailable” is your iPhone’s Security Lockout.",
                    "subtitle": " If the passcode to  is entered incorrectly five times, the “iPhone Unavailable” screen will appear with a message that says “try again in 1 minute.”",
                    "sub-points": [
                        "The amount of time between attempts will increase with each incorrect passcode.After 6 attempts, you'll see \"iPhone Unavailable, try again in 5 minutes.\"After 7 attempts, you'll see \"iPhone Unavailable, try again in 15 minutes.\"After 8 and 9 attempts, you'll see \"iPhone Unavailable, try again in 60 minutes.\"After 10 attempts, you'll see \"iPhone Unavailable,\" with no timer. At this point, the iPhone will need to be restored. It can no longer be unlocked.",
                        "If you previously selected “Erase Data” in your passcode settings, the iPhone’s data will be erased automatically."
                    ]
                }
            ]
        },
        {
            "name": "Wait for the Timer",
            "steps": [
                {
                    "step": "None",
                    "title": "Enter your passcode after the timer ends.",
                    "subtitle": " After the time specified in the “try again in [time]” message passes, you can try to enter your iPhone passcode again.",
                    "sub-points": [
                        "If the passcode has been entered incorrectly ten times, the “iPhone Unavailable” screen will no longer show the “try again” message. Continue to the next method to reset your iPhone."
                    ]
                }
            ]
        },
        {
            "name": "Erase your iPhone",
            "steps": []
        },
        {
            "name": "Reset your iPhone using iTunes",
            "steps": []
        }
    ]
}