{
    "link": "https://www.wikihow.com/Form-a-Strong-Bond-in-Your-Relationship",
    "article": "How to Form a Strong Bond in Your Relationship",
    "intro": "The beginning of a relationship can be a lot of fun, but it’s nothing compared to the deep connection and satisfaction that comes with a strong emotional bond with your partner. It’s the key to a healthy and happy relationship and can help build trust and understanding between two people. The best part is there are things you can do to strengthen your bond. To help you do it, we’ve put together a handy list of options you can use to form and maintain a loving connection with your partner.",
    "points": [
        {
            "name": "Commit to spending quality time together.",
            "steps": [
                {
                    "step": "None",
                    "title": "Set aside some time every day to reconnect with each other.",
                    "subtitle": " It’s so easy to get caught up in your busy day that face-to-face contact with your partner can be reduced to text messages and short phone calls. Make it a goal to take some time in the day to put away your phones, stop thinking about everything else you’ve got going on, and spend some time with your partner. It’ll help reinforce your bond and remind each other how much you care for one another.",
                    "sub-points": [
                        "It could be something simple like a quiet dinner with no electronics or a relaxing movie or TV show that you watch together without distractions.",
                        "You can also go out somewhere nice to eat or just take a stroll around your neighborhood. Quality time doesn’t have to be complicated. All you need is each other!"
                    ]
                },
                {
                    "step": "None",
                    "title": "Set aside some time every day to reconnect with each other.",
                    "subtitle": " It’s so easy to get caught up in your busy day that face-to-face contact with your partner can be reduced to text messages and short phone calls. Make it a goal to take some time in the day to put away your phones, stop thinking about everything else you’ve got going on, and spend some time with your partner. It’ll help reinforce your bond and remind each other how much you care for one another.",
                    "sub-points": [
                        "It could be something simple like a quiet dinner with no electronics or a relaxing movie or TV show that you watch together without distractions.",
                        "You can also go out somewhere nice to eat or just take a stroll around your neighborhood. Quality time doesn’t have to be complicated. All you need is each other!"
                    ]
                }
            ]
        },
        {
            "name": "Try new things together.",
            "steps": [
                {
                    "step": "None",
                    "title": "Keep your quality time fun and interesting.",
                    "subtitle": " Going to the same restaurant or movie theater for date night can eventually get dull and boring. Spice things up by doing something totally new like a dancing class or something classically romantic like a picnic in a field somewhere. Find new things that you can do together and give it a shot!",
                    "sub-points": [
                        "You could also try to check out a new restaurant every date night or take turns choosing what you’ll do together to keep it interesting."
                    ]
                }
            ]
        },
        {
            "name": "Share your thoughts and feelings with your partner.",
            "steps": [
                {
                    "step": "None",
                    "title": "Encourage honest communication and trust in your relationship.",
                    "subtitle": " Talk to your partner about how you’re feeling and what you’re thinking about. Trust that what you tell them will stay just between the two of you so you can feel comfortable venting and talking through conflicts with each other.",
                    "sub-points": [
                        "Honest and open communication is a sign of a healthy relationship with a strong bond.",
                        "For instance, if you’re stressed out at work and your partner is also asking you to do something, you can say something like, “I’m under a lot of pressure at work right now and I’m feeling really stressed. I need you to understand that and be patient with me.”"
                    ]
                },
                {
                    "step": "None",
                    "title": "Encourage honest communication and trust in your relationship.",
                    "subtitle": " Talk to your partner about how you’re feeling and what you’re thinking about. Trust that what you tell them will stay just between the two of you so you can feel comfortable venting and talking through conflicts with each other.",
                    "sub-points": [
                        "Honest and open communication is a sign of a healthy relationship with a strong bond.",
                        "For instance, if you’re stressed out at work and your partner is also asking you to do something, you can say something like, “I’m under a lot of pressure at work right now and I’m feeling really stressed. I need you to understand that and be patient with me.”"
                    ]
                }
            ]
        },
        {
            "name": "Ask each other questions.",
            "steps": [
                {
                    "step": "None",
                    "title": "Get to know each other as well as you can to build your bond.",
                    "subtitle": " No matter how long you’ve been together, you can always get to know your partner even more. Ask their opinions about things. Ask them how they feel. Ask them about work. Ask them about their childhood and their desires in life. The more you know about your partner (and the more they know about you), the stronger your bond will be.",
                    "sub-points": [
                        "You don’t have to bombard your partner with questions, but try to take advantage of opportunities to get to know them even more. For instance, if you start talking about a book or a movie, try asking them when they saw it, what they thought about it, and whether or not they’d watch it again. You can learn a lot about each other just by asking simple questions."
                    ]
                }
            ]
        },
        {
            "name": "Tell your partner if there’s something you need.",
            "steps": [
                {
                    "step": "None",
                    "title": "Allow them to provide comfort by helping them understand.",
                    "subtitle": " Don’t make your partner guess what’s wrong with you or what you’d like them to do. Be clear and direct and tell them what it is that you need so you can avoid any potential resentment or misunderstanding. By the same token, ask your partner if there’s something that they need if you get a sense that they’re trying to hint at something.",
                    "sub-points": [
                        "For instance, if you need your partner to do something practical like clean up the living room, try just being direct and say something like, “Hey, can you pick up and vacuum the living room?”",
                        "If something is bothering you emotionally, be clear about that, too. For example, you could say something like, “I’m feeling really down right now, can you make me some tea and sit with me, please?”"
                    ]
                },
                {
                    "step": "None",
                    "title": "Allow them to provide comfort by helping them understand.",
                    "subtitle": " Don’t make your partner guess what’s wrong with you or what you’d like them to do. Be clear and direct and tell them what it is that you need so you can avoid any potential resentment or misunderstanding. By the same token, ask your partner if there’s something that they need if you get a sense that they’re trying to hint at something.",
                    "sub-points": [
                        "For instance, if you need your partner to do something practical like clean up the living room, try just being direct and say something like, “Hey, can you pick up and vacuum the living room?”",
                        "If something is bothering you emotionally, be clear about that, too. For example, you could say something like, “I’m feeling really down right now, can you make me some tea and sit with me, please?”"
                    ]
                }
            ]
        },
        {
            "name": "Listen to your partner when they talk to you.",
            "steps": [
                {
                    "step": "None",
                    "title": "Put away any distractions and give them your full attention.",
                    "subtitle": " Listening is a critical part of healthy communication. Whenever your partner is talking to you, look them straight in the eyes, listen to what they have to say, and avoid distractions like your phone. Even if you don’t agree or love what they have to say, it’s important that you show them that you care about them and you’re interested in hearing their thoughts.",
                    "sub-points": [
                        "If your partner doesn’t feel like you listen to them, they may feel less inclined to tell you about their thoughts and feelings or care to listen to yours."
                    ]
                }
            ]
        },
        {
            "name": "Express gratitude as often as you can.",
            "steps": [
                {
                    "step": "None",
                    "title": "Show your partner that you care and you appreciate them.",
                    "subtitle": " Whenever your partner does something for you, tell them that you’re thankful for it. Take every opportunity to express your gratitude to each other. It’s a simple and effective way to strengthen your bond and improve your relationship.",
                    "sub-points": [
                        "For instance, if your partner makes dinner, thank them for it. If you bring them lunch or clean up the kitchen, they should be thankful for that, too.",
                        "Research actually shows that expressing gratitude can improve the relationship for both people. It’s science!"
                    ]
                },
                {
                    "step": "None",
                    "title": "Show your partner that you care and you appreciate them.",
                    "subtitle": " Whenever your partner does something for you, tell them that you’re thankful for it. Take every opportunity to express your gratitude to each other. It’s a simple and effective way to strengthen your bond and improve your relationship.",
                    "sub-points": [
                        "For instance, if your partner makes dinner, thank them for it. If you bring them lunch or clean up the kitchen, they should be thankful for that, too.",
                        "Research actually shows that expressing gratitude can improve the relationship for both people. It’s science!"
                    ]
                }
            ]
        },
        {
            "name": "Support each other at all times.",
            "steps": [
                {
                    "step": "None",
                    "title": "Let them know you have each other’s backs.",
                    "subtitle": " That doesn’t mean you should try to solve all of your partner’s problems. In fact, that can sometimes backfire and cause them to feel like you’re criticizing them. Support just means that you let your partner know that you’re on their side and that you’re there to listen to them and help if you can. Just knowing you have your partner’s support can make you feel better and build a stronger bond between you.",
                    "sub-points": [
                        "For instance, if your partner is having a conflict with someone in their family, you can say something like, “I’m sorry to hear that. It sounds super frustrating, but I’m here if you need me. Please let me know if there’s something I can do to help.”"
                    ]
                }
            ]
        },
        {
            "name": "Talk through conflicts respectfully.",
            "steps": [
                {
                    "step": "None",
                    "title": "It’s okay to disagree, but it’s important to work through them effectively.",
                    "subtitle": " If you and your partner find yourself in an argument, really try to listen to them and understand things from their perspective. Avoid making generalized or absolute statements about each other, such as “You always do this” or “You never do that.” Try to talk to each other about how you’re feeling and if you need to take a “time-out” to cool off, do it. You’ll build a stronger bond by working through your issues together.",
                    "sub-points": [
                        "It’s also helpful to stay focused on the issue at hand and avoid trying to bring up other problems from the past. It can only add to the negativity.",
                        "Talk about how you feel without blaming your partner and use direct language so everyone is on the same page and no one is confused."
                    ]
                },
                {
                    "step": "None",
                    "title": "It’s okay to disagree, but it’s important to work through them effectively.",
                    "subtitle": " If you and your partner find yourself in an argument, really try to listen to them and understand things from their perspective. Avoid making generalized or absolute statements about each other, such as “You always do this” or “You never do that.” Try to talk to each other about how you’re feeling and if you need to take a “time-out” to cool off, do it. You’ll build a stronger bond by working through your issues together.",
                    "sub-points": [
                        "It’s also helpful to stay focused on the issue at hand and avoid trying to bring up other problems from the past. It can only add to the negativity.",
                        "Talk about how you feel without blaming your partner and use direct language so everyone is on the same page and no one is confused."
                    ]
                }
            ]
        },
        {
            "name": "Keep outside relationships alive and well.",
            "steps": [
                {
                    "step": "None",
                    "title": "It’s impossible for one person to meet all of your needs.",
                    "subtitle": " It’s really not fair to expect it from your partner. Maintain healthy relationships with friends and family in addition to your romantic relationship. Make sure all of your emotional needs are being fulfilled and it’ll help strengthen your relationship with your partner.",
                    "sub-points": [
                        "For example, you should still get together with your own friends and spend time with your family.",
                        "That also means your partner should be able to have his own identity and relationships with friends and family as well."
                    ]
                },
                {
                    "step": "None",
                    "title": "It’s impossible for one person to meet all of your needs.",
                    "subtitle": " It’s really not fair to expect it from your partner. Maintain healthy relationships with friends and family in addition to your romantic relationship. Make sure all of your emotional needs are being fulfilled and it’ll help strengthen your relationship with your partner.",
                    "sub-points": [
                        "For example, you should still get together with your own friends and spend time with your family.",
                        "That also means your partner should be able to have his own identity and relationships with friends and family as well."
                    ]
                }
            ]
        },
        {
            "name": "Maintain your own hobbies and interests.",
            "steps": [
                {
                    "step": "None",
                    "title": "It’s important for both you and your partner.",
                    "subtitle": " If there are things you enjoy doing outside of your relationship, keep doing them! Allow your partner to have their own hobbies and activities, too. If you’re both happy and free to maintain your individual identities, it will only make your romantic relationship stronger.",
                    "sub-points": [
                        "If you or your partner feel like you can’t do things you love to do, it can cause anger and resentment to build in your relationship.",
                        "For instance, if you like to play video games and your partner likes to golf with their friends, allow each other the time and space to do the things you enjoy."
                    ]
                },
                {
                    "step": "None",
                    "title": "It’s important for both you and your partner.",
                    "subtitle": " If there are things you enjoy doing outside of your relationship, keep doing them! Allow your partner to have their own hobbies and activities, too. If you’re both happy and free to maintain your individual identities, it will only make your romantic relationship stronger.",
                    "sub-points": [
                        "If you or your partner feel like you can’t do things you love to do, it can cause anger and resentment to build in your relationship.",
                        "For instance, if you like to play video games and your partner likes to golf with their friends, allow each other the time and space to do the things you enjoy."
                    ]
                }
            ]
        },
        {
            "name": "Try couple’s therapy to strengthen your bond.",
            "steps": []
        }
    ]
}