{
    "link": "https://www.wikihow.com/Contact-Apple",
    "article": "How to Contact Apple",
    "intro": "If you are having issues with your Apple products or you want to purchase devices, contacting Apple is a great step. This wikiHow article will teach you how to contact Apple by calling them, chatting with them online, or visiting an Apple store.",
    "points": [
        {
            "name": "Contacting for Support and Service",
            "steps": [
                {
                    "step": "7",
                    "title": "Take your Apple product to a local Authorized Service Provider for help.",
                    "subtitle": " Visit , select your device, choose your topic, then click on “Bring in for Repair.” Type in your full address, city, or ZIP code, and click “Go” to pull up a map of nearby  locations. Visit the Service location, and a Specialist will assist you.",
                    "sub-points": [
                        "If you’d like, you can make a reservation to decrease your wait time. To make a reservation, click on the location you’d like to visit, and choose a time that works for you out of the listed options."
                    ]
                }
            ]
        },
        {
            "name": "Contacting for Sales and Product Information",
            "steps": [
                {
                    "step": "3",
                    "title": "Call Apple Store for Education to buy products for education by phone.",
                    "subtitle": " If you are a student or teacher, call 1–800–692–7753 from 7:00 am to 10:00 pm Central time. If purchasing on behalf of an education institution, call 1–800–800–2775. Call either number to purchase items at the education discount.",
                    "sub-points": [
                        "You can also call this number to check the status of your order.",
                        "Purchasing online is only available for students or teachers in the United States. Visit  and purchase online if you live outside the United States."
                    ]
                },
                {
                    "step": "3",
                    "title": "Call Apple Store for Education to buy products for education by phone.",
                    "subtitle": " If you are a student or teacher, call 1–800–692–7753 from 7:00 am to 10:00 pm Central time. If purchasing on behalf of an education institution, call 1–800–800–2775. Call either number to purchase items at the education discount.",
                    "sub-points": [
                        "You can also call this number to check the status of your order.",
                        "Purchasing online is only available for students or teachers in the United States. Visit  and purchase online if you live outside the United States."
                    ]
                }
            ]
        },
        {
            "name": "Giving Feedback",
            "steps": [
                {
                    "step": "4",
                    "title": "Write your feedback in the “Comments” section and press \"Submit.\"",
                    "subtitle": " Compose the Comments section with details like what you like about your product, what you dislike about the device, or ways to improve overall. Select the type of feedback you are submitting from the drop-down list. When complete, press “Submit” to send your feedback to Apple.",
                    "sub-points": [
                        "Feedback type includes Enhancement Request, Bug Report, Design/Ease of Use, Efficiency/Workflow, Software/Hardware Compatibility, Connectivity/Interoperability, and Configurability"
                    ]
                }
            ]
        }
    ]
}