{
    "link": "https://www.wikihow.com/Remove-a-Musty-Smell-from-Clothes-Without-Washing-Them",
    "article": "No Need for Laundry: 11 Easy Ways to Remove Musty Smells from Clothes Without Washing Them",
    "intro": "Nobody likes funky-smelling clothes, but sometimes you just don’t have the time, patience, or ability to wash them. No problem. There are plenty of things you can do to freshen up those musty clothes. Check out this list of options and choose the best solution for you so you can leave the funk behind—no washing necessary!",
    "points": [
        {
            "name": "Spray them with white vinegar.",
            "steps": [
                {
                    "step": "None",
                    "title": "It’s a simple solution that packs a punch.",
                    "subtitle": " Take a spray bottle and fill it with half white vinegar and half water. Gently shake it to mix it together well. Spray your clothes with the mixture and hang them up to dry for about a day or so before you wear it so the vinegary smell is gone.",
                    "sub-points": [
                        "If you’re worried about the vinegar affecting the fabric of your clothes, try spraying a small amount on a small, inconspicuous spot to test it out.",
                        "Make sure you dilute the vinegar with water or you could end up replacing your musty smell with the scent of vinegar.",
                        "Don’t use apple cider vinegar, which could stain or discolor your clothes."
                    ]
                },
                {
                    "step": "None",
                    "title": "It’s a simple solution that packs a punch.",
                    "subtitle": " Take a spray bottle and fill it with half white vinegar and half water. Gently shake it to mix it together well. Spray your clothes with the mixture and hang them up to dry for about a day or so before you wear it so the vinegary smell is gone.",
                    "sub-points": [
                        "If you’re worried about the vinegar affecting the fabric of your clothes, try spraying a small amount on a small, inconspicuous spot to test it out.",
                        "Make sure you dilute the vinegar with water or you could end up replacing your musty smell with the scent of vinegar.",
                        "Don’t use apple cider vinegar, which could stain or discolor your clothes."
                    ]
                },
                {
                    "step": "None",
                    "title": "It’s a simple solution that packs a punch.",
                    "subtitle": " Take a spray bottle and fill it with half white vinegar and half water. Gently shake it to mix it together well. Spray your clothes with the mixture and hang them up to dry for about a day or so before you wear it so the vinegary smell is gone.",
                    "sub-points": [
                        "If you’re worried about the vinegar affecting the fabric of your clothes, try spraying a small amount on a small, inconspicuous spot to test it out.",
                        "Make sure you dilute the vinegar with water or you could end up replacing your musty smell with the scent of vinegar.",
                        "Don’t use apple cider vinegar, which could stain or discolor your clothes."
                    ]
                }
            ]
        },
        {
            "name": "Spritz them with vodka.",
            "steps": [
                {
                    "step": "None",
                    "title": "Don’t worry, you won’t smell boozy once it dries.",
                    "subtitle": " Fill a spray bottle with straight, unflavored vodka. Spray your clothes and hang them up to air dry and to allow the vodka smell to fade away and you’re all set!",
                    "sub-points": [
                        "You can also use vodka to target extra-musty regions of your clothing (such as the underarms) if you don’t want to spray the whole surface.",
                        "Use unflavored vodka so you don’t add an additional unpleasant odor and so your clothes don’t end up being sticky (which can happen if there’s sugar in the vodka)."
                    ]
                },
                {
                    "step": "None",
                    "title": "Don’t worry, you won’t smell boozy once it dries.",
                    "subtitle": " Fill a spray bottle with straight, unflavored vodka. Spray your clothes and hang them up to air dry and to allow the vodka smell to fade away and you’re all set!",
                    "sub-points": [
                        "You can also use vodka to target extra-musty regions of your clothing (such as the underarms) if you don’t want to spray the whole surface.",
                        "Use unflavored vodka so you don’t add an additional unpleasant odor and so your clothes don’t end up being sticky (which can happen if there’s sugar in the vodka)."
                    ]
                }
            ]
        },
        {
            "name": "Hit them with essential oils.",
            "steps": [
                {
                    "step": "None",
                    "title": "They’ll overpower any unpleasant odors on your clothes.",
                    "subtitle": " Take your favorite  and add a few drops into a spray bottle full of water. Spritz your clothes with the sweet-smelling solution, let ‘em dry, and you’re good to go.",
                    "sub-points": [
                        "You can use any essential oil that you like, but some may be more effective for getting out musty smells such as lavender, grapefruit, and lemon.",
                        "Essential oils can be overwhelming and difficult to remove if you add too much. Make sure you dilute a few drops into a bottle of water!"
                    ]
                },
                {
                    "step": "None",
                    "title": "They’ll overpower any unpleasant odors on your clothes.",
                    "subtitle": " Take your favorite  and add a few drops into a spray bottle full of water. Spritz your clothes with the sweet-smelling solution, let ‘em dry, and you’re good to go.",
                    "sub-points": [
                        "You can use any essential oil that you like, but some may be more effective for getting out musty smells such as lavender, grapefruit, and lemon.",
                        "Essential oils can be overwhelming and difficult to remove if you add too much. Make sure you dilute a few drops into a bottle of water!"
                    ]
                }
            ]
        },
        {
            "name": "Spot-treat with lemon juice.",
            "steps": [
                {
                    "step": "None",
                    "title": "Target those extra musty regions.",
                    "subtitle": " Lemon naturally kills odor-causing bacteria and leaves your clothes  with a pleasant scent at the same time. Add a few drops of  to a spray bottle of water and spray areas like the armpits and groin regions of your clothes—the places that can smell the mustiest between washes. Let your clothes airdry and they’re good to wear.",
                    "sub-points": [
                        "Pure lemon juice could stain or discolor your clothes, so make sure you dilute it in a spray bottle full of water."
                    ]
                }
            ]
        },
        {
            "name": "Absorb the smell with baking soda.",
            "steps": [
                {
                    "step": "None",
                    "title": "It can actually absorb the musty odor.",
                    "subtitle": " Put your musty clothes in a large plastic bag and sprinkle in some baking soda. Give the bag a good shake so the baking soda covers all of your clothes and then leave it to sit for 10 minutes. Then, remove your clothes, brush off the baking soda, and bam—no more musty smell!",
                    "sub-points": [
                        "You can also combine baking soda and water to form a thick paste that you can apply directly to especially musty regions. Leave it to dry and harden and then brush it off."
                    ]
                }
            ]
        },
        {
            "name": "Brush them with a clothing and upholstery brush.",
            "steps": [
                {
                    "step": "None",
                    "title": "Get rid of any lint, fuzz, pills, and hair that can trap odors.",
                    "subtitle": "  and dryer lint can really add a funky smell to your clothing. Take an upholstery brush and brush your clothes well to remove anything stuck to the surface.",
                    "sub-points": [
                        "You can find clothing and upholstery brushes at your local department store or home goods store. You can also order them online.",
                        "If you used baking soda to help absorb the odors, you can follow up with a brush to remove the baking soda and anything else stuck to the surface of your clothes."
                    ]
                },
                {
                    "step": "None",
                    "title": "Get rid of any lint, fuzz, pills, and hair that can trap odors.",
                    "subtitle": "  and dryer lint can really add a funky smell to your clothing. Take an upholstery brush and brush your clothes well to remove anything stuck to the surface.",
                    "sub-points": [
                        "You can find clothing and upholstery brushes at your local department store or home goods store. You can also order them online.",
                        "If you used baking soda to help absorb the odors, you can follow up with a brush to remove the baking soda and anything else stuck to the surface of your clothes."
                    ]
                }
            ]
        },
        {
            "name": "Use a refreshing fabric spray.",
            "steps": [
                {
                    "step": "None",
                    "title": "Remove the funk and add a pleasant smell to your clothes.",
                    "subtitle": " There are a variety of fabric sprays that come in all sorts of smells. Simply spritz your musty-smelling clothes and let them air dry. The unpleasant odor will be gone and your clothes will be left smelling great!",
                    "sub-points": [
                        "Your clothes will end up smelling like the spray you use, so make sure you like the scent before you use it."
                    ]
                }
            ]
        },
        {
            "name": "Freeze them for a few hours.",
            "steps": [
                {
                    "step": "None",
                    "title": "The cold can actually kill smelly bacteria.",
                    "subtitle": " Place your clothes in a large freezer bag and seal it shut. Stick the bag into your freezer and leave it for a few hours to allow the cold temperature to . Then, take out the bag, let your clothes warm up a bit, and you’re all set.",
                    "sub-points": [
                        "When you first remove your clothes from the freezer, they may be a bit stiff. Let them warm up for a few minutes before you put them on so they feel softer."
                    ]
                }
            ]
        },
        {
            "name": "Toss them in the dryer.",
            "steps": [
                {
                    "step": "None",
                    "title": "Add a fabric softener sheet and a clean towel to get rid of the must.",
                    "subtitle": " The  will add a pleasant smell and the towel will help absorb moisture and unpleasant odors. Simply place them in the dryer along with your clothes and turn on the dryer for about 10 minutes. That’s it!",
                    "sub-points": [
                        "Tossing your clothes in the dryer can also help remove any wrinkles in them."
                    ]
                }
            ]
        },
        {
            "name": "Air them out.",
            "steps": [
                {
                    "step": "None",
                    "title": "Let the funk fade away on its own.",
                    "subtitle": " Probably the simplest solution is to simply place your clothes on a hanger and then hang them outside of your closet. Let them hang for about a day or so and the musty odor will disappear like magic.",
                    "sub-points": [
                        "It’s also a good idea to let your clothes air out before you hang them up in your closet after wearing them. It can help prevent odor-causing bacteria from making them smell all musty."
                    ]
                }
            ]
        },
        {
            "name": "Hang them up in the sun.",
            "steps": []
        }
    ]
}