{
    "link": "https://www.wikihow.com/Assemble-Jigsaw-Puzzles",
    "article": "How to Assemble Jigsaw Puzzles",
    "intro": "Assembling jigsaw puzzles is a great pastime that can be both relaxing and challenging. You can have fun experimenting with different methods for assembling a puzzle, especially if you’re new to jigsaws. Once you figure out how you want to sort the pieces and put your puzzle together, you’ll feel like a pro. When you’re finished with your puzzle, donate it, preserve it, or just pack it away to assemble in the future.",
    "points": [
        {
            "name": "Getting Started",
            "steps": [
                {
                    "step": "4",
                    "title": "Pull out all of the edge pieces.",
                    "subtitle": " Look for pieces that have a smooth side that can be part of the edge of the puzzle and put those in a pile. Also pull out any pieces that are shaped very differently than the other pieces. When you’re assembling the puzzle, it will eventually be obvious where these specially shaped pieces belong.",
                    "sub-points": [
                        "Keep in mind that finding the edges of non-rectangular puzzles can be very difficult."
                    ]
                }
            ]
        },
        {
            "name": "Assembling the Puzzle",
            "steps": []
        },
        {
            "name": "Working with a Completed Puzzle",
            "steps": [
                {
                    "step": "4",
                    "title": "Make your own frame.",
                    "subtitle": " Buy a ¼” (0.635 cm) thick piece of foam board that is larger on all sides than your puzzle. Put your puzzle on the board and mark the perimeter of the jigsaw on the board with a pencil. Slide the jigsaw off the board and use a hobby knife to trim the board so it will fit exactly against the back of your puzzle. Glue your puzzle to the back of the board.",
                    "sub-points": [
                        "Use a very strong glue or spray adhesive so the puzzle won’t fall off the board.",
                        "Weigh down the puzzle on the board to ensure it adheres. Try using heavy, flat objects like books."
                    ]
                },
                {
                    "step": "4",
                    "title": "Make your own frame.",
                    "subtitle": " Buy a ¼” (0.635 cm) thick piece of foam board that is larger on all sides than your puzzle. Put your puzzle on the board and mark the perimeter of the jigsaw on the board with a pencil. Slide the jigsaw off the board and use a hobby knife to trim the board so it will fit exactly against the back of your puzzle. Glue your puzzle to the back of the board.",
                    "sub-points": [
                        "Use a very strong glue or spray adhesive so the puzzle won’t fall off the board.",
                        "Weigh down the puzzle on the board to ensure it adheres. Try using heavy, flat objects like books."
                    ]
                }
            ]
        }
    ]
}