{
    "link": "https://www.wikihow.com/Get-Beautiful-While-You-Sleep",
    "article": "How to Get Beautiful While You Sleep",
    "intro": "A good night's sleep is essential if you want to look and feel your best. In addition to making sure you get enough sleep, there are lots of other things you can do to maximize your beauty benefits. Your body regenerates itself while you sleep, and you can take advantage of its natural processes to get better looking skin, hair, and more! There are even some easy ways to style your hair while you sleep.",
    "points": [
        {
            "name": "Getting Beautiful Hair",
            "steps": [
                {
                    "step": "4",
                    "title": "Banish frizz.",
                    "subtitle": " No matter what kind of hair you have, you can help keep it looking great between shampooing by tying it up in a silk scarf before bed.",
                    "sub-points": [
                        "If you don't want to wear a scarf to bed, try sleeping on a silk pillowcase. It will create much less friction than a cotton pillowcase, which means less frizz."
                    ]
                }
            ]
        },
        {
            "name": "Getting Beautiful Skin While You Sleep",
            "steps": [
                {
                    "step": "8",
                    "title": "Fight acne.",
                    "subtitle": " If you have acne-prone skin, fight off the bacteria that cause blemishes with a nightly application of an acne cream that contains salicylic acid.",
                    "sub-points": [
                        "For stubborn blemishes, try applying a clay mask before bed.",
                        "For a more natural treatment, try applying a mixture of cinnamon and honey to your face before bed."
                    ]
                },
                {
                    "step": "8",
                    "title": "Fight acne.",
                    "subtitle": " If you have acne-prone skin, fight off the bacteria that cause blemishes with a nightly application of an acne cream that contains salicylic acid.",
                    "sub-points": [
                        "For stubborn blemishes, try applying a clay mask before bed.",
                        "For a more natural treatment, try applying a mixture of cinnamon and honey to your face before bed."
                    ]
                }
            ]
        },
        {
            "name": "Reaping Other Beauty Benefits",
            "steps": [
                {
                    "step": "5",
                    "title": "Whiten your teeth.",
                    "subtitle": " After brushing your teeth as you normally would, dip your toothbrush in some baking soda and brush them again. Don't rinse your mouth out.",
                    "sub-points": [
                        "Don't do this more often than once a week or you may damage your teeth!",
                        "You can do this at any time of day, but you should avoid eating or drinking anything for at least one hour after application, which makes bedtime ideal."
                    ]
                },
                {
                    "step": "5",
                    "title": "Whiten your teeth.",
                    "subtitle": " After brushing your teeth as you normally would, dip your toothbrush in some baking soda and brush them again. Don't rinse your mouth out.",
                    "sub-points": [
                        "Don't do this more often than once a week or you may damage your teeth!",
                        "You can do this at any time of day, but you should avoid eating or drinking anything for at least one hour after application, which makes bedtime ideal."
                    ]
                }
            ]
        }
    ]
}