{
    "link": "https://www.wikihow.com/Treat-Your-Girlfriend",
    "article": "How to Treat Your Girlfriend",
    "intro": "Any guy can ",
    "points": [
        {
            "name": "Respecting Your Girlfriend",
            "steps": [
                {
                    "step": "7",
                    "title": "Be fearless around your girlfriend.",
                    "subtitle": " One way of showing how much you respect your girlfriend is to be unafraid about the things you can express to her. This isn't to say that you should make a point to reveal deeply personal information early on in your relationship. Rather, it means that you should be  to her. Don't be afraid to tell her how you feel - even if it's a bad feeling.",
                    "sub-points": [
                        "Paradoxically, this can also mean . You can (and should) occasionally talk to your girlfriend about deep-seated sources of worry - for instance, your performance at school or work, stressful relationships with your parents, and so on."
                    ]
                }
            ]
        },
        {
            "name": "Showing that You Care for Your Girlfriend",
            "steps": [
                {
                    "step": "6",
                    "title": "Let her know that she's valuable to you.",
                    "subtitle": " This goes far beyond everyday compliments, which can become rote and dull if you repeat them too often. Instead, when you want to make your girlfriend feel amazing, be specific, drawing examples from your personal history and attempting to genuinely express your inner thoughts. Also, try to adjust the \"sappiness\" of your comments to a level that you know your girlfriend is comfortable with. Finally, choose especially poignant opportunities to make these types of comments - no matter how  good you are with words, you can cheapen your thoughts by repeating them incessantly.",
                    "sub-points": [
                        "For example, if you know your girlfriend is comfortable with a little sappiness in your expressions of verbal affection, rather than saying, \"Hey, nice dress\", you might say, \"I like your dress. It reminds me of that dress you wore when we first met.\" This is much sweeter and has the added benefit of showing that you remember a small deal from early in your relationship."
                    ]
                }
            ]
        },
        {
            "name": "Showing Your Girlfriend a Good Time",
            "steps": [
                {
                    "step": "5",
                    "title": "Make her feel like she's special.",
                    "subtitle": " Your girlfriend is undoubtedly important to you, so let her know that this the case. If you do nothing else on your night out, tell (and show) your girlfriend that she really, really means a lot to you. Everything else - the fun you have, the adventures you go on, the time you spend together - is just a way of expressing this truth.",
                    "sub-points": [
                        "The best,  to tell your girlfriend that she's important to you is almost always to just be completely frank about it. Flowery, elegant language is no substitute for genuine emotion - almost all girlfriends will be able to tell when you're being yourself and when you're not."
                    ]
                }
            ]
        }
    ]
}