{
    "link": "https://www.wikihow.com/IPad-Unavailable",
    "article": "6 Ways to Fix a Disabled iPad with iTunes, Finder, Find My, and More",
    "intro": "Are you running into an \"iPad Unavailable\" message on your tablet? This message shows up when you've incorrectly entered your passcode too many times, and if you continue to enter a wrong passcode it can completely disable your device. The only way to really fix this issue is to reset your iPad to factory settings. In this article we'll go over all the ways you can reset your iPad to get back into your device.",
    "points": [
        {
            "name": "Erase From Lockout Screen (iPadOS 15.2 & Later)",
            "steps": [
                {
                    "step": "5",
                    "title": "Tap  to start the reset process.",
                    "subtitle": " Once your iPad restarts, follow the on-screen instructions to get it set up. If you have a recent iCloud backup, you can restore your iPad from that backup without needing a computer, otherwise you can connect your iPad to a computer with iTunes to restore your settings from an iTunes backup.",
                    "sub-points": [
                        "If you don't want to restore your device from a backup or you don't have one available, you can simply opt to skip this step in the setup process. Your iPad will still be reset and functional, but you won't have any of your old data and settings."
                    ]
                }
            ]
        },
        {
            "name": "Erase with iTunes (iPadOS 15.1 and earlier)",
            "steps": [
                {
                    "step": "5",
                    "title": "Disconnect your iPad from your computer to set it up.",
                    "subtitle": " During the setup process, your iPad will ask if you want to restore your device from a backup. If you have an iTunes backup, you can plug your device back in when prompted to restore your data.",
                    "sub-points": [
                        "If you don't have a backup, your iPad will still work but you won't have any of your old data or settings."
                    ]
                }
            ]
        },
        {
            "name": "iCloud Website",
            "steps": []
        },
        {
            "name": "Find My App on Another Device",
            "steps": []
        },
        {
            "name": "Finder on a Mac",
            "steps": []
        },
        {
            "name": "Go to an Apple Store",
            "steps": []
        }
    ]
}