{
    "link": "https://www.wikihow.com/Become-a-New-Article-Booster-on-wikiHow",
    "article": "New Article Boosting: Requirements, Testing & More",
    "intro": "In the wonderful world of wikiHow, New Article Boosters (also known as \"NABers\" or \"boosters\") take a closer look at new articles on the site. Think of them like a second pair of eyes on all of wikiHow’s content—they help get good articles out to readers and demote articles that need a little more work before they can be promoted to fully-published status. Boosters also play an important role in helping new writers get adjusted to wikiHow, and providing advice that will help them get their articles fully published. Since boosters need to be both familiar with wikiHow’s policies and good at coaching others, contributors need to take a test before they can start on any boosting duties. Ready to get started? Read on for a step-by-step guide on how you can take the NAB exam and become the latest NABer in the wikiHow community.",
    "points": [
        {
            "name": "Preparing for the Exam",
            "steps": []
        },
        {
            "name": "Taking the Test",
            "steps": [
                {
                    "step": "4",
                    "title": "Complete several rounds of trial boosting before getting approved.",
                    "subtitle": " During this trial portion of the test, you'll be able to carry out all the regular boosting activities (promotion, demotion, title changes, etc), except for voting in the NFD Guardian. You'll receive feedback based on your edits, actions, and messages as you go, or after you complete the batch as asked. After you get that feedback, you will generally be asked to continue trial boosting for several other rounds of boosting, each time tackling up to the assigned batch quantity. Be sure to check in for feedback when you reach each limit, and to use the feedback to help you hone your skills as you go. Also, feel free to ask questions!",
                    "sub-points": [
                        "As long as you stay reasonably active and continue to do trial boosts when you can, there's no set time limit to how long you can take for your batches of boosting. However, if you go inactive during your trial, you'll get some follow-up reminders and check-ins about the status of your trial. If you still aren't active over a longer period of time and just aren't doing any trial boosting, your trial may be put on hold and your provisional rights removed until you can devote more time to the task."
                    ]
                }
            ]
        }
    ]
}