{
    "link": "https://www.wikihow.com/Prune-a-Money-Tree",
    "article": "How and When Should You Prune a Money Tree?",
    "intro": "A money tree, also known as a “Good Luck Tree,” is a plant that is said to bring positive energy to a space and thought to be good luck for money. Money trees are popular because they require very little effort to maintain.",
    "points": [
        {
            "name": "Deciding When to Prune",
            "steps": []
        },
        {
            "name": "Pruning the Tree",
            "steps": [
                {
                    "step": "6",
                    "title": "Trim the tree down to no more than half its size.",
                    "subtitle": " Err on the side of caution and trim the tree a little at a time. Remove a few overgrown branches and any brown leaves. Then, step back and look over the shape of the tree. If the tree still looks uneven in shape, trim off more branches until it looks more uniform.",
                    "sub-points": [
                        "Do not remove too many branches or leaves, as this can stunt the growth of the tree. Remove a little at a time, rather than a lot of the tree at once."
                    ]
                }
            ]
        },
        {
            "name": "Maintaining the Tree",
            "steps": [
                {
                    "step": "3",
                    "title": " the tree every 2-3 years.",
                    "subtitle": " If you notice the tree’s root system has filled the pot, you may need to repot the tree. Time the repotting for the mid-summer months. Remove the tree and the soil from the pot. Use clean gardening shears to prune back 1/4 of the roots. Then, place the tree in a new pot with drainage holes or gravel and fresh soil.",
                    "sub-points": [
                        "Water the money tree well after you repot it to encourage growth. You can submerge the entire pot in a tub of water or use a watering can to water the roots well."
                    ]
                }
            ]
        }
    ]
}