{
    "link": "https://www.wikihow.com/Kiss-Your-Boyfriend-to-Make-Him-Crazy",
    "article": "How to Kiss Your Boyfriend to Make Him Crazy",
    "intro": "Want to drive your boyfriend crazy? Up your kissing game to take your lip-locking from dull to delightful. It doesn't take much to ",
    "points": [
        {
            "name": "Gaze into your boyfriend’s eyes.",
            "steps": [
                {
                    "step": "None",
                    "title": "Keep your eyes locked on him until he looks deep into your eyes, too.",
                    "subtitle": " This way you're connected before you even start to kiss. Don't even think about looking away yet! Hold your gaze, so you're really bonding.",
                    "sub-points": [
                        "You'll want to close your eyes when you actually kiss, but great  is really important before you lock lips.",
                        "Staring into his eyes allows those butterflies to build up in your chest—and his, too!"
                    ]
                },
                {
                    "step": "None",
                    "title": "Keep your eyes locked on him until he looks deep into your eyes, too.",
                    "subtitle": " This way you're connected before you even start to kiss. Don't even think about looking away yet! Hold your gaze, so you're really bonding.",
                    "sub-points": [
                        "You'll want to close your eyes when you actually kiss, but great  is really important before you lock lips.",
                        "Staring into his eyes allows those butterflies to build up in your chest—and his, too!"
                    ]
                }
            ]
        },
        {
            "name": "Bring your boyfriend close to you.",
            "steps": [
                {
                    "step": "None",
                    "title": "Put your arms around his waist and pull him close.",
                    "subtitle": " If he's wearing a jacket, clutch it and use it to bring him near you. Take a few moments to enjoy being right next to each other and keep making eye contact.",
                    "sub-points": [
                        "Sometimes, taking things slow is the best way to drive your boyfriend crazy, especially if you're pressed up against each other.",
                        "You can also pull him in by the hips or pull him in by the hand."
                    ]
                },
                {
                    "step": "None",
                    "title": "Put your arms around his waist and pull him close.",
                    "subtitle": " If he's wearing a jacket, clutch it and use it to bring him near you. Take a few moments to enjoy being right next to each other and keep making eye contact.",
                    "sub-points": [
                        "Sometimes, taking things slow is the best way to drive your boyfriend crazy, especially if you're pressed up against each other.",
                        "You can also pull him in by the hips or pull him in by the hand."
                    ]
                }
            ]
        },
        {
            "name": "Lean in for a kiss then pull away for a few seconds.",
            "steps": [
                {
                    "step": "None",
                    "title": "This teasing behavior drives him crazy!",
                    "subtitle": " Think about it—he's fully prepared for you to kiss and you delay gratification which just makes him want to kiss you even more. You don't have to pull away for long to make this effective. After a second or two, lean back in for the kiss.",
                    "sub-points": [
                        "This is also a great way to break tension if either of you is a little nervous about kissing."
                    ]
                }
            ]
        },
        {
            "name": "Hold his face in your hands.",
            "steps": [
                {
                    "step": "None",
                    "title": "Cup the sides of his face and pull him even closer to you.",
                    "subtitle": " Now you don't have to worry about bumping noses! Plus, it also shows to him that you're being possessive. You want him and you're not afraid to show it.",
                    "sub-points": [
                        "Guys love it when their partner takes the initiative so don't be afraid to make some moves."
                    ]
                }
            ]
        },
        {
            "name": "Offer a single sensual kiss.",
            "steps": []
        },
        {
            "name": "Kiss him again but with more tongue.",
            "steps": [
                {
                    "step": "None",
                    "title": "Open your mouth slightly and press it against his lips.",
                    "subtitle": " As the passion builds,  into his mouth and flick your tongue against his. Take your time and experiment with kissing his upper and lower lip.",
                    "sub-points": [
                        "Get comfortable—you might tilt your head and close your eyes so you can really focus on the sensation.",
                        "Try to match your boyfriend's movements during the kiss. You want to fit together like a puzzle so it feels comfortable."
                    ]
                },
                {
                    "step": "None",
                    "title": "Open your mouth slightly and press it against his lips.",
                    "subtitle": " As the passion builds,  into his mouth and flick your tongue against his. Take your time and experiment with kissing his upper and lower lip.",
                    "sub-points": [
                        "Get comfortable—you might tilt your head and close your eyes so you can really focus on the sensation.",
                        "Try to match your boyfriend's movements during the kiss. You want to fit together like a puzzle so it feels comfortable."
                    ]
                }
            ]
        },
        {
            "name": "Kiss his earlobes or along his jawline.",
            "steps": [
                {
                    "step": "None",
                    "title": "Break up the kisses by moving a little lower around his face.",
                    "subtitle": " Give a few gentle tugs on his earlobes if you're in a playful mood or plant lots of kisses along his jaw. If you really want to drive him crazy, kiss around his face, but wait before you kiss his lips again.",
                    "sub-points": [
                        "You can do this standing up, but it's also really effective if you're laying down together."
                    ]
                }
            ]
        },
        {
            "name": "Plant kisses along his neck and shoulders.",
            "steps": [
                {
                    "step": "None",
                    "title": "Explore kissing other parts of his body to spice things up.",
                    "subtitle": " Kiss his throat or the sides of his  to get him excited. Take your time and work across his shoulders. You can keep kissing down along his torso or go back up for deep passionate kisses on the lips.",
                    "sub-points": [
                        "Make this a game! Kiss your boyfriend all over to find the most sensitive spots on his body.",
                        "Feel free to combine these kisses with a massage, too. Start with a  before working your way up to his arms and shoulders. Then, plant a kiss on his neck while you're massaging his shoulders."
                    ]
                },
                {
                    "step": "None",
                    "title": "Explore kissing other parts of his body to spice things up.",
                    "subtitle": " Kiss his throat or the sides of his  to get him excited. Take your time and work across his shoulders. You can keep kissing down along his torso or go back up for deep passionate kisses on the lips.",
                    "sub-points": [
                        "Make this a game! Kiss your boyfriend all over to find the most sensitive spots on his body.",
                        "Feel free to combine these kisses with a massage, too. Start with a  before working your way up to his arms and shoulders. Then, plant a kiss on his neck while you're massaging his shoulders."
                    ]
                }
            ]
        },
        {
            "name": "Play around with giving cold kisses.",
            "steps": [
                {
                    "step": "None",
                    "title": "Sip something ice-cold and immediately kiss his inner wrist.",
                    "subtitle": " This is a really sensitive spot and the chilly sensation can drive him wild. You could also plant cool kisses along his neck or jawline to mix things up.",
                    "sub-points": [
                        "Have fun with temperature! Try sipping something hot and planting kisses on sensitive spots."
                    ]
                }
            ]
        },
        {
            "name": "Experiment with humming while you kiss.",
            "steps": [
                {
                    "step": "None",
                    "title": "Your boyfriend will be pleasantly surprised by the vibration.",
                    "subtitle": " Sure, it might feel a little strange for you to hum while you kiss him, but the sensation will blow his mind! Try humming while you kiss his neck or kiss your way down his chest.",
                    "sub-points": [
                        "Play around with humming—higher pitches make faster vibrations that may tickle while lower pitches make a slower, sensual sensation."
                    ]
                }
            ]
        },
        {
            "name": "Move your hands over his body while you kiss.",
            "steps": [
                {
                    "step": "None",
                    "title": "Run your fingers through his hair, stroke his arm, or embrace him.",
                    "subtitle": " If you keep your hands still, you'll come across as stiff. Instead, move your hands over his body as you kiss. You might drag your fingers down his back, place your hands on his hips, or rub his thighs.",
                    "sub-points": [
                        "If your guy seems a little awkward, grasp his hands and place them on your body. For instance, if he's keeping his hands at his sides, pull them toward you and place them on your hips.",
                        "If he doesn't seem to be into it, try communicating with him about his wants and desires. You can get expert help with wikiHow’s course: . This course is created by a Sex and Relationship Psychologist, and it will walk you through how to talk to your partner about kissing, sex, and other intimate activities."
                    ]
                },
                {
                    "step": "None",
                    "title": "Run your fingers through his hair, stroke his arm, or embrace him.",
                    "subtitle": " If you keep your hands still, you'll come across as stiff. Instead, move your hands over his body as you kiss. You might drag your fingers down his back, place your hands on his hips, or rub his thighs.",
                    "sub-points": [
                        "If your guy seems a little awkward, grasp his hands and place them on your body. For instance, if he's keeping his hands at his sides, pull them toward you and place them on your hips.",
                        "If he doesn't seem to be into it, try communicating with him about his wants and desires. You can get expert help with wikiHow’s course: . This course is created by a Sex and Relationship Psychologist, and it will walk you through how to talk to your partner about kissing, sex, and other intimate activities."
                    ]
                }
            ]
        }
    ]
}