{
    "link": "https://www.wikihow.com/Repair-Perm-Damaged-Hair",
    "article": "How to Repair Perm Damaged Hair",
    "intro": "Perms can be tough on hair, so give your locks some love! Since the perming process can dry out your hair, focus on restoring moisture and protecting your hair from damage. Even making a few changes like adding a weekly deep-moisturizer and air drying your hair can improve the health of your hair. All the extra hydration can make your hair feel softer and less frizzy.",
    "points": [
        {
            "name": "Moisturizing and Repairing Dry Hair",
            "steps": [
                {
                    "step": "6",
                    "title": "Add a monthly warm olive oil treatment to your hair to help it relax and straighten.",
                    "subtitle": " If your hair is really frizzy and dry, pour   c (120 ml) of olive oil into a pan and turn the burner to low. Once the oil is warm, turn off the burner and let it cool until you can touch it. Massage the oil into your dry hair so it's completely coated and let it sit for 15 minutes. Then, wash your hair with shampoo and rinse it well.",
                    "sub-points": [
                        "Use a wide comb to gently work the oil through your hair from root to tip.",
                        "You can do the warm oil treatment once a month until your hair looks smooth and healthy again."
                    ]
                },
                {
                    "step": "6",
                    "title": "Add a monthly warm olive oil treatment to your hair to help it relax and straighten.",
                    "subtitle": " If your hair is really frizzy and dry, pour   c (120 ml) of olive oil into a pan and turn the burner to low. Once the oil is warm, turn off the burner and let it cool until you can touch it. Massage the oil into your dry hair so it's completely coated and let it sit for 15 minutes. Then, wash your hair with shampoo and rinse it well.",
                    "sub-points": [
                        "Use a wide comb to gently work the oil through your hair from root to tip.",
                        "You can do the warm oil treatment once a month until your hair looks smooth and healthy again."
                    ]
                }
            ]
        },
        {
            "name": "Protecting Your Hair from Damage",
            "steps": [
                {
                    "step": "8",
                    "title": "Trim your hair to get rid of split ends and keep it looking healthy.",
                    "subtitle": " Is your perm wispy and unruly at the ends? Unfortunately, a bad perm can damage your hair so you have ends that stick out straight below the curls or waves. Look closely at your ends and snip away any that are split or stick out noticeably. You don't have to trim a lot—about  inch (1.3 cm) will remove the split ends and encourage your hair to grow.",
                    "sub-points": [
                        "Although you can do this yourself, it might be easier to ask a friend to help you trim the back of your hair."
                    ]
                }
            ]
        }
    ]
}