{
    "link": "https://www.wikihow.com/Unlock-iPhone-Passcode-Without-Computer",
    "article": "4 Ways to Access a Locked iPhone without a Computer",
    "intro": "If you’ve forgotten the passcode for unlocking your iPhone, you won't need a computer to unlock it. There are still ways to get in. Most methods involve erasing your iPhone so that you can set it up again with a new passcode. Depending on which version of iOS you have, you may be able to reset your iPhone from the Security Lockout screen, erase it remotely with Find My or iCloud, or even get in using glitches in the Siri app. This wikiHow article will teach you the easiest ways to unlock your iPhone and reset the passcode without using a computer.",
    "points": [
        {
            "name": "Reset from the Lock Screen",
            "steps": [
                {
                    "step": "7",
                    "title": "Follow the instructions to restore your phone.",
                    "subtitle": " Once your phone is done resetting, follow the onscreen prompts to set it up again. This will also give you the opportunity to set a new passcode that’s easier to remember!",
                    "sub-points": [
                        "If you like, you can also set up an alternative method for unlocking your phone, such as Face ID or Touch ID. However, not all iPhone models support these methods."
                    ]
                }
            ]
        },
        {
            "name": "Using Find My",
            "steps": [
                {
                    "step": "8",
                    "title": "Set your iPhone up again after erasing it.Erase Pending",
                    "subtitle": " Your iPhone will be erased and reset next time it connects to a Wi-Fi or cellular network. If it’s not connected to a network, you’ll see an  message on the screen. Once the reset process is complete, you’ll need to set your iPhone up again and create a new passcode or other login method.",
                    "sub-points": [
                        "When you erase an iPhone this way, it will go into  mode. You’ll need to enter your Apple ID and password to unlock it before you can set it up again.If you’ve forgotten your Apple ID or password, you’ll need to reset them on another device.",
                        "If you change your mind, you can cancel the process if your phone is offline and hasn’t started erasing yet. Select your iPhone in the list of devices on Find My and tap , then enter your Apple ID and password again."
                    ]
                },
                {
                    "step": "8",
                    "title": "Set your iPhone up again after erasing it.Erase Pending",
                    "subtitle": " Your iPhone will be erased and reset next time it connects to a Wi-Fi or cellular network. If it’s not connected to a network, you’ll see an  message on the screen. Once the reset process is complete, you’ll need to set your iPhone up again and create a new passcode or other login method.",
                    "sub-points": [
                        "When you erase an iPhone this way, it will go into  mode. You’ll need to enter your Apple ID and password to unlock it before you can set it up again.If you’ve forgotten your Apple ID or password, you’ll need to reset them on another device.",
                        "If you change your mind, you can cancel the process if your phone is offline and hasn’t started erasing yet. Select your iPhone in the list of devices on Find My and tap , then enter your Apple ID and password again."
                    ]
                }
            ]
        },
        {
            "name": "Using iCloud",
            "steps": [
                {
                    "step": "7",
                    "title": "Follow the prompts to confirm and reset your iPhone.",
                    "subtitle": " Once you confirm that you want to erase your iPhone, the erasing process will begin. After all the data is erased from your phone, it will go into Activation Lock mode. You’ll need to log in with your Apple ID and password to set the phone up again.",
                    "sub-points": [
                        "Your phone won’t erase until it’s turned on and connected to Wi-Fi or a cellular network.",
                        "If your iPhone isn’t currently online, you can always select your device in iCloud and click  to cancel the process."
                    ]
                },
                {
                    "step": "7",
                    "title": "Follow the prompts to confirm and reset your iPhone.",
                    "subtitle": " Once you confirm that you want to erase your iPhone, the erasing process will begin. After all the data is erased from your phone, it will go into Activation Lock mode. You’ll need to log in with your Apple ID and password to set the phone up again.",
                    "sub-points": [
                        "Your phone won’t erase until it’s turned on and connected to Wi-Fi or a cellular network.",
                        "If your iPhone isn’t currently online, you can always select your device in iCloud and click  to cancel the process."
                    ]
                }
            ]
        },
        {
            "name": "Hacking in with Siri (iOS 8.0 to 10.1)",
            "steps": [
                {
                    "step": "16",
                    "title": "Press the Home button.HomeSettings",
                    "subtitle": " As soon as the album opens, press the  button on your phone. This will unlock your phone and take you to the Home Screen. From there, you can open your  app and reset your passcode!",
                    "sub-points": [
                        "This is one of several methods for unlocking an older iPhone using a glitch in the Siri app. If it doesn’t work for you, consider trying one of the following:"
                    ]
                }
            ]
        }
    ]
}