{
    "link": "https://www.wikihow.com/Play-Jenga",
    "article": "How to Setup and Play a Game of Jenga",
    "intro": " There’s nothing quite like the tension and drama of plucking the trickiest of Jenga blocks from the precarious tower. The sweet relief of a successful turn, the glorious destruction when it all comes tumbling down. It’s easy to see why Jenga is such a classic, so get in on the fun! We’ll show you how to build the tower and play the game, and we’ll even offer some prime strategy tips while you’re here.",
    "points": [
        {
            "name": "Building the Tower",
            "steps": [
                {
                    "step": "4",
                    "title": "Write questions or dares on the block for a fun twist.",
                    "subtitle": " This is an optional variation of Jenga. Before you stack the tower, write something on each block: a question, a \"dare,\" or some other action. Then, shuffle the blocks and stack the Jenga tower as usual. When each person pulls a block from the tower, they must do whatever is written on the block.",
                    "sub-points": [
                        "Questions might be flirtatious (\"Who do you most want to kiss in this room?), thoughtful (\"When was a time that you felt small?\"), or humorous (\"What is your most embarrassing moment?\")",
                        "Dares might be anything from \"Trade one item of clothing with the person beside you,\" to \"Drink a shot of hot sauce,\" to \"Make a scary face.\""
                    ]
                },
                {
                    "step": "4",
                    "title": "Write questions or dares on the block for a fun twist.",
                    "subtitle": " This is an optional variation of Jenga. Before you stack the tower, write something on each block: a question, a \"dare,\" or some other action. Then, shuffle the blocks and stack the Jenga tower as usual. When each person pulls a block from the tower, they must do whatever is written on the block.",
                    "sub-points": [
                        "Questions might be flirtatious (\"Who do you most want to kiss in this room?), thoughtful (\"When was a time that you felt small?\"), or humorous (\"What is your most embarrassing moment?\")",
                        "Dares might be anything from \"Trade one item of clothing with the person beside you,\" to \"Drink a shot of hot sauce,\" to \"Make a scary face.\""
                    ]
                }
            ]
        },
        {
            "name": "Playing the Game",
            "steps": []
        },
        {
            "name": "Strategizing",
            "steps": [
                {
                    "step": "5",
                    "title": "Play to win, not to build a high tower.",
                    "subtitle": " If you care about the competitive aspect of the game, then you don't want the tower to fall on your turn. Don’t work together to see how high you can build; plan out your moves to destabilize the structure so that it will topple on someone else. Remove important pieces from near the bottom of the stack to trip up your opponents.",
                    "sub-points": [
                        ". Respect other players, and do not go out of your way to mess them up while they're taking their turns. Remember: if you lose this time, there’s always the next game to prove your skill!"
                    ]
                }
            ]
        }
    ]
}