{
    "link": "https://www.wikihow.com/Make-Your-Labrador-Retriever-Happier",
    "article": "How to Make Your Labrador Retriever Happier",
    "intro": "If you own a labrador retriever, you probably already know how kind, playful, and fun-loving this breed can be. As a good pet owner, you probably do your best to keep your dog as happy as possible. But, there are always new ways to make him even happier, and to keep him healthy.",
    "points": [
        {
            "name": "Keeping Your Lab Active",
            "steps": [
                {
                    "step": "6",
                    "title": "Socialize your lab.",
                    "subtitle": " Labs love to be around people and other dogs, so find a local dog park to check out with your lab. Just make sure your dog is treated for flea and tick prevention to avoid taking any pests home from the park.",
                    "sub-points": [
                        "If you are thinking about adding another dog to your family, labs tend to mesh well with breeds like collies, golden retrievers, beagles, and corgis, as these breeds are also energetic and sociable. Also, consider adding a dog of the opposite sex, as dogs of the same sex might have issues with dominance."
                    ]
                }
            ]
        },
        {
            "name": "Keeping Your Lab Healthy",
            "steps": [
                {
                    "step": "4",
                    "title": "Monitor your lab for signs of hip dysplasia.",
                    "subtitle": " Hip dysplasia is common in larger breeds of dogs, and labs are prone to developing it with age, especially if they are overweight. It causes problems in the joint of the hip, which can be painful and debilitating over time.",
                    "sub-points": [
                        "If your dog has issues standing up after lying or sitting down, is visibly in pain when his hips are touched or moved, appears to be limping or has a change in his gait, or even shows hesitance to run, walk, or go up stairs, see your vet. These could be signs of issues with your lab’s hips."
                    ]
                }
            ]
        },
        {
            "name": "Showing Your Lab Affection",
            "steps": [
                {
                    "step": "4",
                    "title": "Give your dog praise and affection when they’ve done something good.",
                    "subtitle": " Keep in mind that when you praise a dog and show him love and affection, he will likely associate that as a reward for whatever behavior he has just done. Make sure you show him affection when he has done something good or correct, rather than when he is doing something undesirable, like barking or jumping.",
                    "sub-points": [
                        "If your dog has successfully obeyed a command, has eaten, has done his business outside, or has just come in from some exercise, these are all good times to offer him some love and praise. This will reaffirm those good behaviors."
                    ]
                }
            ]
        }
    ]
}