{
    "link": "https://www.wikihow.com/Error-Validating-Basket-Doordash",
    "article": "Troubleshooting Steps for DoorDash's \"Error Validating Basket\" Message",
    "intro": "Are you trying to place a DoorDash order but you keep getting an \"error validation basket\" message? This is a frustrating situation, especially when you're trying to order your food. Unfortunately there's no one method to fix this error, but we've gathered the best troubleshooting methods for you to try so you can get your DoorDash meal ordered.",
    "points": [
        {
            "name": "Check your internet connection. ",
            "steps": []
        },
        {
            "name": "Update the DoorDash app. ",
            "steps": []
        },
        {
            "name": "Check the restaurant's status. ",
            "steps": [
                {
                    "step": "None",
                    "title": "Ensure the restaurant you're ordering from is still open.",
                    "subtitle": " This is especially true if you're ordering DoorDash late at night, on a weekend, or on a holiday. Tap on the restaurant in the DoorDash app and check to see if they're still open. If they're closed, that's likely the reason you got the error.",
                    "sub-points": [
                        "If you'd like, you can try ordering from a different restaurant to see if that was actually the cause of the issue."
                    ]
                }
            ]
        },
        {
            "name": "Log out of the app and back in. ",
            "steps": [
                {
                    "step": "None",
                    "title": "Sign out of the DoorDash app to fix any session issues.",
                    "subtitle": " If you haven't logged out of the DoorDash app in a while, your login session may become corrupt. This can cause various issues, including problems with placing orders. To fix this, simply log out of the app and then sign back in.",
                    "sub-points": [
                        "You can also restart the app after you log out, as another way to try and clear out corrupt data."
                    ]
                }
            ]
        },
        {
            "name": "Clear the DoorDash app cache. ",
            "steps": [
                {
                    "step": "None",
                    "title": "Empty the app's cache (or reinstall it on iPhone).",
                    "subtitle": " If you're on an Android device, you can try clearing the DoorDash app's . Caches hold temporary files that help apps run faster, but over time these files can become corrupt and cause issues. ",
                    "sub-points": [
                        "To clear an Android app's cache, go to the Apps section of your settings (the exact location varies depending on what type of Android phone you have) and select DoorDash, then tap .",
                        "iPhones can't clear caches manually. If you're on an iPhone, you can instead try  the DoorDash app by pressing and holding on the app and selecting  (or  if it's on the Home Screen), then reinstalling it via the App Store."
                    ]
                },
                {
                    "step": "None",
                    "title": "Empty the app's cache (or reinstall it on iPhone).",
                    "subtitle": " If you're on an Android device, you can try clearing the DoorDash app's . Caches hold temporary files that help apps run faster, but over time these files can become corrupt and cause issues. ",
                    "sub-points": [
                        "To clear an Android app's cache, go to the Apps section of your settings (the exact location varies depending on what type of Android phone you have) and select DoorDash, then tap .",
                        "iPhones can't clear caches manually. If you're on an iPhone, you can instead try  the DoorDash app by pressing and holding on the app and selecting  (or  if it's on the Home Screen), then reinstalling it via the App Store."
                    ]
                }
            ]
        },
        {
            "name": "Your cart is empty. ",
            "steps": [
                {
                    "step": "None",
                    "title": "Make sure you have items in your cart.",
                    "subtitle": " While it's not common, DoorDash will sometimes experience a slight \"hiccup\" when you try to place an item in your cart and not actually add it. When you try to check out, the app will then give you an error because there's nothing in your cart.",
                    "sub-points": [
                        "Tap on your cart and make sure your items are there. If your cart is empty, try re-adding the items and checking out again."
                    ]
                }
            ]
        },
        {
            "name": "Check DoorDash's status. ",
            "steps": [
                {
                    "step": "None",
                    "title": "Use Downdetector to see if DoorDash is having server issues.",
                    "subtitle": " From time to time, the DoorDash app might not work due to server issues. While DoorDash doesn't have a dedicated status page, you can use a site like  to check if DoorDash is down right now.",
                    "sub-points": [
                        "If DoorDash is down, the only thing you can really do is wait for the servers to come back up before trying to place your order again."
                    ]
                }
            ]
        },
        {
            "name": "Place your order on DoorDash's website. ",
            "steps": [
                {
                    "step": "None",
                    "title": "Use the DoorDash website to order your meal.",
                    "subtitle": " While this isn't necessarily a way to fix the basket validation error, you can try placing your order on DoorDash's website instead of the app. You can use your phone's mobile browser or a computer to do this.",
                    "sub-points": [
                        "If DoorDash is having server problems, you won't be able to use the website to order."
                    ]
                }
            ]
        },
        {
            "name": "Contact DoorDash support. ",
            "steps": []
        }
    ]
}