{
    "link": "https://www.wikihow.com/What-Does-Gen-Mean-on-Grindr",
    "article": "“Gen” on Grindr: What It Means, Avoiding Scams & More",
    "intro": "You’re browsing your potential next date options on Grindr when you notice the term “gen” pop up here and there. You might think it means “genuine” at first glance since Grindr is a dating app, but in the niche world of gay online dating, you can never be too sure what a slang word means. In this article, we’ll tell you exactly what “gen” means and how you’ll see it used, plus show you how to safely respond to “gen” messages and keep your personal information secure. Let’s get started!",
    "points": [
        {
            "name": "“Gen” Meaning on Grindr",
            "steps": [
                {
                    "step": "None",
                    "title": "“Gen” is short for “generous” on Grindr (and other dating apps, too).",
                    "subtitle": " “Gen” typically refers to someone who’s looking for or offering money in exchange for an interaction or relationship. The nature of the interaction could be sexual or just platonic, since there are users interested in companionship without a sexual component. You might see “gen,” “gen only,” “generous,” or even “generou$” (just to make it extra clear).",
                    "sub-points": [
                        "“Hi, gen guy here looking for someone to treat to a nice dinner”",
                        "“I’m looking for gen guys only”"
                    ]
                },
                {
                    "step": "None",
                    "title": "“Gen” is short for “generous” on Grindr (and other dating apps, too).",
                    "subtitle": " “Gen” typically refers to someone who’s looking for or offering money in exchange for an interaction or relationship. The nature of the interaction could be sexual or just platonic, since there are users interested in companionship without a sexual component. You might see “gen,” “gen only,” “generous,” or even “generou$” (just to make it extra clear).",
                    "sub-points": [
                        "“Hi, gen guy here looking for someone to treat to a nice dinner”",
                        "“I’m looking for gen guys only”"
                    ]
                }
            ]
        },
        {
            "name": "How to Use “Gen”",
            "steps": [
                {
                    "step": "2",
                    "title": "List “gen” in your profile so anyone can see what you’re looking for.",
                    "subtitle": " If you’d rather not drop it into conversation, mention that you’re “gen” or “looking for gen” in your profile. This way, you’re more likely to only get messages from other users who are interested in that kind of connection. “Gen” situations are typically one-time affairs rather than a prolonged relationship where one personally financially supports the other.",
                    "sub-points": [
                        "“Nice guy looking for casual dates, no strings attached. Can be gen for the right person”",
                        "“Not looking for a long term relationship. Gen guys to the front of the line!”"
                    ]
                },
                {
                    "step": "2",
                    "title": "List “gen” in your profile so anyone can see what you’re looking for.",
                    "subtitle": " If you’d rather not drop it into conversation, mention that you’re “gen” or “looking for gen” in your profile. This way, you’re more likely to only get messages from other users who are interested in that kind of connection. “Gen” situations are typically one-time affairs rather than a prolonged relationship where one personally financially supports the other.",
                    "sub-points": [
                        "“Nice guy looking for casual dates, no strings attached. Can be gen for the right person”",
                        "“Not looking for a long term relationship. Gen guys to the front of the line!”"
                    ]
                }
            ]
        },
        {
            "name": "Responding to “Gen” Offers & Messages Safely",
            "steps": []
        },
        {
            "name": "Can you get banned for saying “gen?”",
            "steps": [
                {
                    "step": "None",
                    "title": "Using “gen” is OK, but outright solicitation violates Grindr’s terms of use.",
                    "subtitle": " “Gen” is a vague, slang term that users send to get around Grindr’s community guidelines, which prohibit “Venmo or PayPal links, sugar daddy/baby arrangements, and Amazon or other wishlist links” (among other offers). In other words, users can report each other for making explicit financial offers, but just saying “gen” alone isn’t enough to get a user suspended or banned.",
                    "sub-points": [
                        "For example, a blunt message like “I’ll give you $45 if you join me for lunch” is solicitation. A more discreet message like “I’m a gen guy looking for lunch dates” is not, however."
                    ]
                }
            ]
        },
        {
            "name": "Are all “gen seekers” on Grindr gay?",
            "steps": [
                {
                    "step": "2",
                    "title": "“Gen” relationships or hookups are part of straight dating apps, too.",
                    "subtitle": " There are plenty of straight, financially stable men and women (called “sugar daddies” or “sugar mamas”) who enjoy or are willing to pay for companionship or intimacy (usually with younger, less wealthy men or women called “sugar babies”). The term “gen” might be more common on gay apps like Grindr, but the idea is not limited to just gay men or queer people.",
                    "sub-points": [
                        "In fact, there are many dating apps—both gay and straight—designed specifically to facilitate “sugar daddy” or “sugar mama” connections."
                    ]
                }
            ]
        },
        {
            "name": "Less Common Meanings of “Gen” Online",
            "steps": [
                {
                    "step": "3",
                    "title": "On TikTok and other social media, “gen” is short for “genuine.”",
                    "subtitle": " In this case, “/gen” is added at the end of a comment or post as a tone indicator. It lets the reader know that the previous statement is genuine, heartfelt, or true as opposed to sarcastic, rhetorical, or a joke.",
                    "sub-points": [
                        "“You’re so amazing! Wishing you the best /gen”",
                        "“Wait, I’m confused. Can someone explain what this video means? /gen”"
                    ]
                },
                {
                    "step": "3",
                    "title": "On TikTok and other social media, “gen” is short for “genuine.”",
                    "subtitle": " In this case, “/gen” is added at the end of a comment or post as a tone indicator. It lets the reader know that the previous statement is genuine, heartfelt, or true as opposed to sarcastic, rhetorical, or a joke.",
                    "sub-points": [
                        "“You’re so amazing! Wishing you the best /gen”",
                        "“Wait, I’m confused. Can someone explain what this video means? /gen”"
                    ]
                }
            ]
        }
    ]
}