{
    "link": "https://www.wikihow.com/Style-Curtain-Bangs",
    "article": "Styling Curtain Bangs with & without Heat",
    "intro": "So, you’ve cut curtain bangs—they’re so cute! But how can you give them that signature swoop? Styling curtain bangs may seem intimidating, but it’s actually easier than you may think. There are multiple ways to give your bangs that voluminous bounce, and we’ve laid them all out here. With our help, you’ll learn what styling technique is best for your hair length and texture so you can look fabulous.",
    "points": [
        {
            "name": "Round Brush & Blow Dryer",
            "steps": [
                {
                    "step": "5",
                    "title": "Brush your bangs forward and fluff them out.",
                    "subtitle": " If your curtain bangs don’t have as much volume as you’d like, repeat the second step, rolling the middle section forward and away from your face while blow drying. Use your fingers or brush to tousle them in place, and you’re done!",
                    "sub-points": [
                        "Set your styled bangs with  to lock everything in place."
                    ]
                }
            ]
        },
        {
            "name": "Flat Iron",
            "steps": [
                {
                    "step": "4",
                    "title": "Tousle your bangs and brush them out.",
                    "subtitle": " Once the curls have cooled, use your fingers to flick the tips out and away from your face. Tousle them with your fingers or gently brush them until they fall the way you want them to.",
                    "sub-points": [
                        "Try holding onto the roots of your bang with one hand while you flick the ends out with the other.",
                        "Consider  framing your bangs away from your face for added texture."
                    ]
                },
                {
                    "step": "4",
                    "title": "Tousle your bangs and brush them out.",
                    "subtitle": " Once the curls have cooled, use your fingers to flick the tips out and away from your face. Tousle them with your fingers or gently brush them until they fall the way you want them to.",
                    "sub-points": [
                        "Try holding onto the roots of your bang with one hand while you flick the ends out with the other.",
                        "Consider  framing your bangs away from your face for added texture."
                    ]
                }
            ]
        },
        {
            "name": "Curling Iron",
            "steps": [
                {
                    "step": "4",
                    "title": "Direct your bangs with a round brush.",
                    "subtitle": " Once your bangs have cooled, remove your clip and let them fall—it’s okay if they’re a bit wild at first! Use a round brush to gently curl them out and away from your face at an angle.",
                    "sub-points": [
                        "Brush the left side of your bangs to the left and the right side to the right."
                    ]
                }
            ]
        },
        {
            "name": "Hair Rollers",
            "steps": []
        },
        {
            "name": "Heatless Styling Methods",
            "steps": []
        },
        {
            "name": "The Dos & Don’ts of Styling",
            "steps": []
        }
    ]
}