{
    "link": "https://www.wikihow.com/Pause-Life360-Without-Anyone-Knowing",
    "article": "Life360: Pausing or Hiding Your Location With Minimal Notifications",
    "intro": "Freedom is an important thing to have as a teenager, but if your parents require you to use Life360 to track your location, you can feel a little stifled. Most easy and safe methods to turn off Life360 tracking do notify the other people in your circle, but we've gathered a few methods on how to hide your Life360 location on iPhone and Android with minimal notifications, as well as how to fake your location entirely. However, remember that you shouldn't turn off Life360 to do anything dangerous or worry your parents.",
    "points": [
        {
            "name": "Enable Low Data Mode",
            "steps": [
                {
                    "step": "2",
                    "title": "Turn off Wi-Fi.",
                    "subtitle": " You can either turn off Wi-Fi for your entire device by disabling it, or you can turn it off for the Life360 app individually via your app settings, if your device allows it.",
                    "sub-points": [
                        "Enabling low data mode is preferable to simply turning off Wi-Fi and data completely, as turning off your connection can set your Life360 location to \"Location paused.\" By using the low data method your location will be set as \"Internet connection problem.\""
                    ]
                }
            ]
        },
        {
            "name": "Get a Burner Phone",
            "steps": [
                {
                    "step": "4",
                    "title": "Open Life360 on the burner and sign in with your email.",
                    "subtitle": " You'll want to use email sign in, as your burner phone will have a different phone number from your personal phone.",
                    "sub-points": [
                        "This will restore your Life360 connection and your circle will be notified that you are online at your current location. Make sure to perform this switch at a location where you're supposed to be, such as at home, school, or work."
                    ]
                }
            ]
        },
        {
            "name": "Spoof Your Location",
            "steps": []
        }
    ]
}