{
    "link": "https://www.wikihow.com/Deep-Things-to-Say-to-Your-Boyfriend-over-Text",
    "article": "Romantic and Thoughtful Texts to Send to Your Boyfriend to Make Him Feel Special",
    "intro": "Whether you spend every day with your boyfriend or are in a long-distance relationship, there are some things you can’t express verbally. Texting is a great way to show your boyfriend how much he means to you and make him feel like the most special guy in the world. If you’re at a loss for words, keep reading: we’ve compiled a list of deep, romantic texts to send your boyfriend to let him know how much you care.",
    "points": [
        {
            "name": "“You’re the best thing that’s ever happened to me.”",
            "steps": []
        },
        {
            "name": "“I love the thought of growing old with you.”",
            "steps": []
        },
        {
            "name": "“I’ve found my person, at last. It’s you.”",
            "steps": []
        },
        {
            "name": "“I didn’t know it was possible to love someone this much.”",
            "steps": []
        },
        {
            "name": "“Life didn’t make sense until I met you.”",
            "steps": []
        },
        {
            "name": "“I can’t believe how lucky I am to have found you.”",
            "steps": []
        },
        {
            "name": "“I wish I could hold you in my arms and never let go.”",
            "steps": []
        },
        {
            "name": "“I can tell you anything.”",
            "steps": []
        },
        {
            "name": "“Words can’t express the love I feel for you.”",
            "steps": []
        },
        {
            "name": "“I can’t wait to make even more memories with you.”",
            "steps": []
        },
        {
            "name": "“I love the way you love me.”",
            "steps": []
        },
        {
            "name": "“I’m so comfortable with you.”",
            "steps": []
        },
        {
            "name": "“I can’t imagine my life without you in it.”",
            "steps": []
        },
        {
            "name": "“Everything you do makes me fall more in love with you.”",
            "steps": []
        },
        {
            "name": "“You still give me butterflies, even after all this time.”",
            "steps": []
        },
        {
            "name": "“You make me a better person.”",
            "steps": []
        },
        {
            "name": "“You’re my lover and my best friend.”",
            "steps": []
        },
        {
            "name": "“You are the most important person in my life, now and always.”",
            "steps": []
        },
        {
            "name": "“What’s your love language?”",
            "steps": []
        },
        {
            "name": "“You’re my favorite person to do everything with.”",
            "steps": []
        },
        {
            "name": "“There is no one more perfect for me than you.”",
            "steps": []
        },
        {
            "name": "“I’ve realized that I think about you more than anything else.”",
            "steps": []
        },
        {
            "name": "“You’ve made me see the world in a whole new way.”",
            "steps": []
        },
        {
            "name": "“I miss you when you aren’t with me.”",
            "steps": []
        }
    ]
}