{
    "link": "https://www.wikihow.com/Play-the-%22Who-Am-I%22-Game",
    "article": "How to Play the \"Who Am I\" Game",
    "intro": "If you're hosting a dinner or a party, the \"Who Am I?\" game can make for a pleasant icebreaker. It is a simple parlour game, comparable to \"Charades\", where players try to guess a name or thing they've been assigned. Although \"Who Am I?\" is extremely simple to organize and set up, you can customize it to be as challenging and competitive as you'd like. The trick to a great game of \"Who Am I\" ultimately lies in catering the game rules to the group you're playing with.",
    "points": [
        {
            "name": "Planning the Game",
            "steps": [
                {
                    "step": "5",
                    "title": "Distribute the game cards.",
                    "subtitle": " Write down a name, place, thing or concept onto a card, and lie it facedown. You can make all of the cards in one go, or tell players to make cards to give to each other.",
                    "sub-points": [
                        "Include some information on the name card. Before delivering the cards to other players, it may be helpful to advise that some basic info be included on the card beside the name. If the players don't have much knowledge overlap, include a few words about what he, she, or it is on the card alongside the answer.",
                        "The \"Who Am I\" game is so synonymous with Post-It notes that the Post-It note company features the rules on their official website."
                    ]
                },
                {
                    "step": "5",
                    "title": "Distribute the game cards.",
                    "subtitle": " Write down a name, place, thing or concept onto a card, and lie it facedown. You can make all of the cards in one go, or tell players to make cards to give to each other.",
                    "sub-points": [
                        "Include some information on the name card. Before delivering the cards to other players, it may be helpful to advise that some basic info be included on the card beside the name. If the players don't have much knowledge overlap, include a few words about what he, she, or it is on the card alongside the answer.",
                        "The \"Who Am I\" game is so synonymous with Post-It notes that the Post-It note company features the rules on their official website."
                    ]
                }
            ]
        },
        {
            "name": "Deducing Your Answer",
            "steps": [
                {
                    "step": "4",
                    "title": "State your answer.",
                    "subtitle": " Regardless what your session's rules on guessing are, there will come a point where you'll have to put your theory to the test. When you are reasonably certain what your answer is, call it out. Don't give an answer unless you're confident with it. Even for rounds where there are no disqualification penalties for wrong guesses, being liberal with the number of answers will cheapen the sport of the game for everyone.",
                    "sub-points": [
                        "At the same time, don't be too conservative with your guesses. In most cases, the stakes for a game of \"Who Am I?\" won't be too high. Stressing out over the certainty of an answer won't make the game more fun. If there's a competitive aspect to your session, hesitating with your answer may end up with someone beating you to the chase."
                    ]
                }
            ]
        },
        {
            "name": "Answering Other Players' Questions",
            "steps": [
                {
                    "step": "4",
                    "title": "Play again.",
                    "subtitle": " You and your group may choose to play again once the other players have finished guessing their answers. If this is the case, you should make a new set of cards for people to use. Reshuffling and swapping the cards you've already used is an option as well, but since people will have seen all of the cards, a second round offers players the possibility of deducing their answer simply by looking at the cards of other players.",
                    "sub-points": [
                        "Sessions tend to get more enjoyable once people have warmed up and have a positive social momentum going."
                    ]
                }
            ]
        },
        {
            "name": "Exploring Variations of the Game",
            "steps": []
        }
    ]
}