{
    "link": "https://www.wikihow.com/Games-to-Play-with-Your-Girlfriend",
    "article": "50+ Conversation, Board, and Video Games to Play with Your Girlfriend",
    "intro": "If you and your girlfriend are looking for new things to do, why not play a fun game? There are a ton of great games you can play with just two people, including conversation games, board games, and even video games. In this article, we’ve gathered 50+ of the best games you can play with your girlfriend in person, over text, or online.",
    "points": [
        {
            "name": "Conversation Games to Play with Your Girlfriend (Text & In-Person)",
            "steps": [
                {
                    "step": "11",
                    "title": "Simon Says",
                    "subtitle": " You probably  as a kid, but you can make it more romantic by instructing your partner to kiss or hug you. If you’re unfamiliar with the game, one person will be “Simon” and tell the other player what to do. That player will only obey if the Simon character says “Simon says” before the task.",
                    "sub-points": [
                        "For example, if you’re Simon and you say “Simon says give me a hug,” your girlfriend would hug you. But if you only said “Give me a hug,” she wouldn’t. If she did, she would lose the game.",
                        "Try to say things quickly to trip your partner up."
                    ]
                },
                {
                    "step": "11",
                    "title": "Simon Says",
                    "subtitle": " You probably  as a kid, but you can make it more romantic by instructing your partner to kiss or hug you. If you’re unfamiliar with the game, one person will be “Simon” and tell the other player what to do. That player will only obey if the Simon character says “Simon says” before the task.",
                    "sub-points": [
                        "For example, if you’re Simon and you say “Simon says give me a hug,” your girlfriend would hug you. But if you only said “Give me a hug,” she wouldn’t. If she did, she would lose the game.",
                        "Try to say things quickly to trip your partner up."
                    ]
                }
            ]
        },
        {
            "name": "Video Games to Play with Your Girlfriend",
            "steps": []
        },
        {
            "name": "Board & Card Games to Play with Your Girlfriend",
            "steps": []
        },
        {
            "name": "No Set-Up Games to Play with Your Girlfriend",
            "steps": [
                {
                    "step": "14",
                    "title": "Romantic Tic Tac Toe",
                    "subtitle": " Playing Tic Tac Toe might not sound very romantic, but there are ways you can spice it up. When making your Tic Tac Toe board, write a romantic activity in each square, like kissing, hugging, or giving your partner a massage. When you place your “X” or “O” on the square, you must do whatever action is listed. ",
                    "sub-points": [
                        "If you’re not looking to do anything intimate, you can also make the game more fun by writing different dares on the squares instead."
                    ]
                }
            ]
        }
    ]
}