{
    "link": "https://www.wikihow.com/Use-Eucalyptus-Oil",
    "article": "How to Use Eucalyptus Oil",
    "intro": "Eucalyptus oil smells delightful and has many handy uses. You can use it on your body to perfume your bath, nourish your hair, and repel mosquitoes. You can also use eucalyptus oil to soothe congestion by breathing in eucalyptus-scented steam. Whatever the use, you’ll enjoy eucalyptus oil’s fresh, bright aroma.",
    "points": [
        {
            "name": "Using Eucalyptus Oil on Your Body",
            "steps": [
                {
                    "step": "4",
                    "title": "Avoid putting undiluted eucalyptus oil on your skin.",
                    "subtitle": " Plain eucalyptus oil can irritate and burn your skin. Instead, combine it with a carrier oil, like olive oil or coconut oil, before you put it on your skin or hair.",
                    "sub-points": [
                        "You can also buy lotions, creams, and even toothpastes, that have a bit of eucalyptus oil mixed into them. These are safe to use, because the eucalyptus oil is diluted."
                    ]
                }
            ]
        },
        {
            "name": "Soothing Congestion with Eucalyptus Steam",
            "steps": [
                {
                    "step": "4",
                    "title": "Breathe deeply to inhale the eucalyptus-scented steam.",
                    "subtitle": " Keep breathing in and out for a few minutes, until you can breathe through your nose. You should feel your sinuses clearing from the steam.",
                    "sub-points": [
                        "The eucalyptus oil will give you a cool, bright sensation, similar to eating mint. This is very soothing for head colds.",
                        "Repeat this process once a day for the duration of your head cold for congestion relief."
                    ]
                },
                {
                    "step": "4",
                    "title": "Breathe deeply to inhale the eucalyptus-scented steam.",
                    "subtitle": " Keep breathing in and out for a few minutes, until you can breathe through your nose. You should feel your sinuses clearing from the steam.",
                    "sub-points": [
                        "The eucalyptus oil will give you a cool, bright sensation, similar to eating mint. This is very soothing for head colds.",
                        "Repeat this process once a day for the duration of your head cold for congestion relief."
                    ]
                }
            ]
        }
    ]
}