{
    "link": "https://www.wikihow.com/Uno-Rules-Stacking",
    "article": "To Stack or Not to Stack? Uno's Official Stance on Card Stacking—and How to Do It Anyway",
    "intro": "To stack or not to stack? It’s a hotly debated topic when it comes to the classic card game Uno: when presented with a Draw card, can you stack another Draw card if you have one, passing the burden to draw onto the next player? Or must you simply draw the assigned number of cards and miss your turn? Keep reading to learn the ins and outs of Uno, including the official stacking rules—and the not-so-official ones.",
    "points": [
        {
            "name": "Can you stack in Uno?",
            "steps": [
                {
                    "step": "None",
                    "title": "Uno has officially stated that you cannot stack your cards.",
                    "subtitle": " For decades, Uno lovers have been responding to a Draw 2 or Draw 4 card by stacking another Draw card on top and passing the burden to draw extra cards onto the next player—who may then stack their own Draw card on top. But Uno’s official Twitter account has stated that stacking Draw cards is expressly forbidden.",
                    "sub-points": [
                        "Despite Uno’s ban, many players continue to view stacking as a legitimate Uno strategy and ignore the official rules.",
                        "Why stack? Stacking brings a bit more intensity to the game. Players may end up being forced to draw upwards of 12 cards."
                    ]
                },
                {
                    "step": "None",
                    "title": "Uno has officially stated that you cannot stack your cards.",
                    "subtitle": " For decades, Uno lovers have been responding to a Draw 2 or Draw 4 card by stacking another Draw card on top and passing the burden to draw extra cards onto the next player—who may then stack their own Draw card on top. But Uno’s official Twitter account has stated that stacking Draw cards is expressly forbidden.",
                    "sub-points": [
                        "Despite Uno’s ban, many players continue to view stacking as a legitimate Uno strategy and ignore the official rules.",
                        "Why stack? Stacking brings a bit more intensity to the game. Players may end up being forced to draw upwards of 12 cards."
                    ]
                }
            ]
        },
        {
            "name": "How to Bend the Rules and Stack Cards",
            "steps": [
                {
                    "step": "3",
                    "title": "For the most intense game, stack any Draw card.",
                    "subtitle": " In this variation, if a player lays down a Draw 2 card, the following player may stack either a Draw 2 card or a Wild Draw 4 card. If a Wild Draw 4 is laid down, the next player may lay a Wild Draw 4 card or a Draw 2 card.",
                    "sub-points": [
                        "This variation allows for the possibility that the player who eventually draws will be forced to draw a lot of cards—even 12 or more! Play this variation if you’re feeling particularly vindictive."
                    ]
                }
            ]
        },
        {
            "name": "Official Uno Rules",
            "steps": []
        }
    ]
}