{
    "link": "https://www.wikihow.com/What-to-Wear-to-a-Massage",
    "article": "What to Wear to a Massage: Proper Massage Etiquette",
    "intro": "Going in for your first massage? Get ready for some rest and relaxation! But heading into a massage can leave you with a lot of questions, such as what do I wear to the appointment? How much clothing do I take off during the massage? In this article, we’ll give you all the dos and don’ts when getting a massage, including what to wear and how far to undress. For all the massage etiquette you’ll need, read on!",
    "points": [
        {
            "name": "Wear loose, comfortable clothing to your massage.",
            "steps": [
                {
                    "step": "None",
                    "title": "Pick an outfit that you can quickly take off and put back on.",
                    "subtitle": " Sweatpants, athletic shorts, and baggy T-shirts are all a great choice to wear to a massage. For a high-end salon, try something like a jumpsuit or a romper. Avoid wearing anything tight or form-fitting, since you’ll likely be covered in lotion or oil after your appointment.",
                    "sub-points": [
                        "Wear comfortable undergarments that you wouldn’t mind getting oily. Even if you take off your underwear during your appointment, they might still get some massage oil on them when you get dressed afterwards.",
                        "Wear sandals or sneakers that you can easily kick off before your appointment."
                    ]
                },
                {
                    "step": "None",
                    "title": "Pick an outfit that you can quickly take off and put back on.",
                    "subtitle": " Sweatpants, athletic shorts, and baggy T-shirts are all a great choice to wear to a massage. For a high-end salon, try something like a jumpsuit or a romper. Avoid wearing anything tight or form-fitting, since you’ll likely be covered in lotion or oil after your appointment.",
                    "sub-points": [
                        "Wear comfortable undergarments that you wouldn’t mind getting oily. Even if you take off your underwear during your appointment, they might still get some massage oil on them when you get dressed afterwards.",
                        "Wear sandals or sneakers that you can easily kick off before your appointment."
                    ]
                }
            ]
        },
        {
            "name": "Put your hair up.",
            "steps": [
                {
                    "step": "None",
                    "title": "Get your hair out of the way of your neck and shoulders.",
                    "subtitle": " Bring a scrunchie or a clip with you to secure your hair before your appointment. Plus, this will keep your hair from getting oily or greasy as your massage therapist works on you.",
                    "sub-points": [
                        "Some massage therapists will massage your scalp as part of your appointment. If you don’t want them to touch your hair or massage your scalp, just tell them ahead of time."
                    ]
                }
            ]
        },
        {
            "name": "Come fresh-faced.",
            "steps": [
                {
                    "step": "None",
                    "title": "No need to wear makeup, as it's likely to get smudged on the massage table.",
                    "subtitle": " There’s no need to get super ready for a massage—this is all about your relaxation. Stick to minimal makeup if you’d like to do it, or just come with a fresh face.",
                    "sub-points": [
                        "Some massage therapists will massage your face, but you can ask them not to if you’d prefer them to avoid it.",
                        "Similarly, avoid using fake tanner before a massage appointment, since it will likely get smudged by the lotion or oil your therapist uses."
                    ]
                },
                {
                    "step": "None",
                    "title": "No need to wear makeup, as it's likely to get smudged on the massage table.",
                    "subtitle": " There’s no need to get super ready for a massage—this is all about your relaxation. Stick to minimal makeup if you’d like to do it, or just come with a fresh face.",
                    "sub-points": [
                        "Some massage therapists will massage your face, but you can ask them not to if you’d prefer them to avoid it.",
                        "Similarly, avoid using fake tanner before a massage appointment, since it will likely get smudged by the lotion or oil your therapist uses."
                    ]
                }
            ]
        },
        {
            "name": "Dress down to your comfort level.",
            "steps": [
                {
                    "step": "None",
                    "title": "Wear as much or as little clothing as you’d like during the massage.",
                    "subtitle": " When it’s time for your appointment, feel free to take off some, all, or none of your clothing. Most people dress down to their underwear for the first time, while others are completely fine being naked under the massage blanket. A massage is all about your comfort, so do what feels right for you and your body.",
                    "sub-points": [
                        "Rest assured that your massage therapist will keep your body covered up the entire time. If they’re not working on a particular area, it will stay covered up underneath a blanket or sheet.",
                        "If you don’t want to take any of your clothes off, let your massage therapist know. They can modify the massage to meet your comfort level."
                    ]
                },
                {
                    "step": "None",
                    "title": "Wear as much or as little clothing as you’d like during the massage.",
                    "subtitle": " When it’s time for your appointment, feel free to take off some, all, or none of your clothing. Most people dress down to their underwear for the first time, while others are completely fine being naked under the massage blanket. A massage is all about your comfort, so do what feels right for you and your body.",
                    "sub-points": [
                        "Rest assured that your massage therapist will keep your body covered up the entire time. If they’re not working on a particular area, it will stay covered up underneath a blanket or sheet.",
                        "If you don’t want to take any of your clothes off, let your massage therapist know. They can modify the massage to meet your comfort level."
                    ]
                }
            ]
        },
        {
            "name": "Take a shower beforehand.",
            "steps": [
                {
                    "step": "None",
                    "title": "Do a quick wash at home so your body is clean before your appointment.",
                    "subtitle": " It’s polite to do a hygiene check before coming in for a massage. Clean your body with body wash, and put on some deodorant before coming in.",
                    "sub-points": [
                        "Don’t use any heavy fragrances, like perfume or cologne, out of respect for your massage therapist. Strong scents could be overpowering during your appointment.",
                        "Don’t worry about shaving any body hair if you don’t want to. Massage therapists have seen all sorts of body types, and they definitely won’t judge however much or however little body hair you have."
                    ]
                },
                {
                    "step": "None",
                    "title": "Do a quick wash at home so your body is clean before your appointment.",
                    "subtitle": " It’s polite to do a hygiene check before coming in for a massage. Clean your body with body wash, and put on some deodorant before coming in.",
                    "sub-points": [
                        "Don’t use any heavy fragrances, like perfume or cologne, out of respect for your massage therapist. Strong scents could be overpowering during your appointment.",
                        "Don’t worry about shaving any body hair if you don’t want to. Massage therapists have seen all sorts of body types, and they definitely won’t judge however much or however little body hair you have."
                    ]
                }
            ]
        },
        {
            "name": "Stay hydrated before your session.",
            "steps": [
                {
                    "step": "None",
                    "title": "Drink water throughout the day before your massage.",
                    "subtitle": " Massages can be dehydrating, so sip on water to keep your fluid levels up. However, avoid guzzling a whole bottle of water before your appointment—it will probably just make you have to pee during your massage.",
                    "sub-points": [
                        "Make sure you drink plenty of water after your massage, too."
                    ]
                }
            ]
        },
        {
            "name": "Eat a snack, but not a heavy meal.",
            "steps": [
                {
                    "step": "None",
                    "title": "Try not to get super full to avoid any discomfort.",
                    "subtitle": " You’ll probably be lying on your stomach for at least part of your massage appointment. Feel free to eat like normal throughout the day, but don’t chow down on a huge feast right beforehand. Otherwise, you might feel a bit uncomfortable.",
                    "sub-points": [
                        "Don’t drink any alcohol before your appointment, either. Massages are meant to be relaxing and peaceful, and being inebriated could lessen that effect."
                    ]
                }
            ]
        },
        {
            "name": "Silence your phone.",
            "steps": [
                {
                    "step": "None",
                    "title": "Put your phone on silent to avoid distractions during the massage.",
                    "subtitle": " Before your appointment, your massage therapist will likely direct you to a chair or cabinet where you can put your personal items. Be sure to put your phone on silent so it doesn’t ring during your appointment.",
                    "sub-points": [
                        "Your massage therapist will likely play some relaxing music during your appointment."
                    ]
                }
            ]
        },
        {
            "name": "Speak up and ask questions if you have any.",
            "steps": [
                {
                    "step": "None",
                    "title": "Communicate with your massage therapist before and during the massage.",
                    "subtitle": " If it’s your first massage, you’ll likely chat with your therapist about what your goals are for the session and any spots that have been bothering you. During your massage, feel free to speak up and ask them to adjust the pressure or move to a different area.",
                    "sub-points": [
                        "No need to feel awkward—your massage is all about you! Your therapist wants you to speak up so they know you feel comfortable and relaxed."
                    ]
                }
            ]
        },
        {
            "name": "Ask your therapist to avoid certain areas if you’re sensitive.",
            "steps": [
                {
                    "step": "None",
                    "title": "If you feel uncomfortable being touched on a specific body part, speak up.",
                    "subtitle": " Some people don’t like to have their feet touched, while others are very ticklish in certain areas. If there are any spots you don’t want them to work on, let them know beforehand.",
                    "sub-points": [
                        "“My back is super ticklish; could you avoid that area if you can?”",
                        "“I’m not a fan of anyone touching my feet. I’d love it if we could skip that area.”"
                    ]
                },
                {
                    "step": "None",
                    "title": "If you feel uncomfortable being touched on a specific body part, speak up.",
                    "subtitle": " Some people don’t like to have their feet touched, while others are very ticklish in certain areas. If there are any spots you don’t want them to work on, let them know beforehand.",
                    "sub-points": [
                        "“My back is super ticklish; could you avoid that area if you can?”",
                        "“I’m not a fan of anyone touching my feet. I’d love it if we could skip that area.”"
                    ]
                }
            ]
        },
        {
            "name": "Take a nap during your massage if you’d like to.",
            "steps": [
                {
                    "step": "None",
                    "title": "Massage therapists are used to people falling asleep during appointments.",
                    "subtitle": " Don’t feel pressured to talk to your massage therapist. If you fall asleep during the massage, great! And if you don’t, that’s fine, too.",
                    "sub-points": [
                        "Don’t worry about any other bodily functions that might happen during your massage, either. Drooling, snoring, passing gas—your massage therapist has seen it all, and they know how to handle things professionally."
                    ]
                }
            ]
        },
        {
            "name": "Plan to tip for your massage.",
            "steps": [
                {
                    "step": "None",
                    "title": "A tip isn’t necessary, but it’s considered polite.",
                    "subtitle": " After your massage when you’re checking out, there will likely be a tip option. It’s customary to tip 20%, but you can adjust that based on your experience.",
                    "sub-points": [
                        "If you had a really great experience, feel free to tip more than 20%. You can also write a stellar review on the massage therapist’s website to bring them more business.",
                        "You can also bring cash to tip your massage therapist directly."
                    ]
                },
                {
                    "step": "None",
                    "title": "A tip isn’t necessary, but it’s considered polite.",
                    "subtitle": " After your massage when you’re checking out, there will likely be a tip option. It’s customary to tip 20%, but you can adjust that based on your experience.",
                    "sub-points": [
                        "If you had a really great experience, feel free to tip more than 20%. You can also write a stellar review on the massage therapist’s website to bring them more business.",
                        "You can also bring cash to tip your massage therapist directly."
                    ]
                }
            ]
        },
        {
            "name": "Respect your massage therapist.",
            "steps": [
                {
                    "step": "None",
                    "title": "Don’t talk about sex or make them feel uncomfortable in any way.",
                    "subtitle": " You may have heard jokes about “happy ending” massages before, but those jokes usually aren’t received well by professional massage therapists. Treat them with respect and behave appropriately so you’ll both have a pleasant experience.",
                    "sub-points": [
                        "Even joking about sexual acts is enough to get you kicked out of some massage therapist's offices."
                    ]
                }
            ]
        }
    ]
}