{
    "link": "https://www.wikihow.com/Spring-Clean-Your-Room",
    "article": "How to Spring Clean Your Room",
    "intro": "When spring comes around, a lot of people take this opportunity to do some deep cleaning around their home, otherwise known as spring cleaning. For many of us, the most important part of spring cleaning is cleaning our bedrooms. However, if your room is really dirty or cluttered, you may not know where to start. Fortunately, by focusing on one aspect of cleaning your room at a time, you can spring clean your room in no time!",
    "points": [
        {
            "name": "Freshening the Bedding",
            "steps": [
                {
                    "step": "7",
                    "title": "Allow the mattress to air dry before putting the linens back on it.",
                    "subtitle": " Place the mattress in direct sunlight and leave it for a few hours. After the mattress has dried, flip it over to rotate it, if this is recommended by the manufacturer.",
                    "sub-points": [
                        "Read the tag on your mattress to find out whether the manufacturer advises if you should rotate your mattress on an annual basis.",
                        "If only a few parts of the mattress are wet, you can also opt to use a hairdryer on warm on these spots to dry them quickly. Never use a hairdryer on hot, though, as this may start a fire on your mattress."
                    ]
                },
                {
                    "step": "7",
                    "title": "Allow the mattress to air dry before putting the linens back on it.",
                    "subtitle": " Place the mattress in direct sunlight and leave it for a few hours. After the mattress has dried, flip it over to rotate it, if this is recommended by the manufacturer.",
                    "sub-points": [
                        "Read the tag on your mattress to find out whether the manufacturer advises if you should rotate your mattress on an annual basis.",
                        "If only a few parts of the mattress are wet, you can also opt to use a hairdryer on warm on these spots to dry them quickly. Never use a hairdryer on hot, though, as this may start a fire on your mattress."
                    ]
                }
            ]
        },
        {
            "name": "Getting Rid of Dust",
            "steps": [
                {
                    "step": "6",
                    "title": "Don’t forget to dust all the furniture in your room.",
                    "subtitle": " Wipe down your dresser, desk, bookshelf, or any other piece of furniture in your room with a duster or with furniture polish. This is especially important if you don’t already dust your furniture on a regular basis.",
                    "sub-points": [
                        "Take this opportunity to wipe down the insides of your dresser drawers, as well."
                    ]
                }
            ]
        },
        {
            "name": "Cleaning the Floor",
            "steps": [
                {
                    "step": "4",
                    "title": "Use dish detergent and hot water to treat carpet stains.",
                    "subtitle": " Mix equal parts of hot water and dish soap in a spray bottle, then spray this mixture onto the stain. Use a clean cloth to blot the stain and transfer the colored liquid from the carpet fibers to the cloth. Continue blotting this way until the stain is completely gone.",
                    "sub-points": [
                        "You may need to switch to a second clean cloth if the stain is too large for your first cloth to handle.",
                        "If this mixture of dish detergent and water doesn’t do the trick, use a mixture of unscented ammonia and water instead."
                    ]
                },
                {
                    "step": "4",
                    "title": "Use dish detergent and hot water to treat carpet stains.",
                    "subtitle": " Mix equal parts of hot water and dish soap in a spray bottle, then spray this mixture onto the stain. Use a clean cloth to blot the stain and transfer the colored liquid from the carpet fibers to the cloth. Continue blotting this way until the stain is completely gone.",
                    "sub-points": [
                        "You may need to switch to a second clean cloth if the stain is too large for your first cloth to handle.",
                        "If this mixture of dish detergent and water doesn’t do the trick, use a mixture of unscented ammonia and water instead."
                    ]
                }
            ]
        },
        {
            "name": "Decluttering and Organizing Your Room",
            "steps": [
                {
                    "step": "5",
                    "title": "Remove any furniture in your room that isn’t actually necessary.",
                    "subtitle": " Take a look around and make a note of any piece of furniture, such as a half-empty bookshelf or bare coffee table, that you don’t actually need in your room. Getting rid of these items of furniture or moving them to a different room will free up a ton of floor space, leaving your room feeling much larger as a result.",
                    "sub-points": [
                        "For example, if you have 2 small bookshelves with only a few books on each of them, consider investing in a new, larger bookshelf. Place all of your books on this large bookshelf and move the smaller shelves to a separate room in your home."
                    ]
                }
            ]
        }
    ]
}