{
    "link": "https://www.wikihow.com/Report-Scam-Numbers",
    "article": "How to Report Scam Phone Numbers",
    "intro": "When you get a phone call and the person on the other end makes you promises that seem too good to be true or threatens you with legal action if you don't pay them money, you are likely dealing with a scam. It's important to report scam numbers to the proper authorities so the scammer doesn't claim any more victims. This wikiHow article will teach you how to report scam phone numbers to the FTC, FBI, your cellular provider, and impersonated companies and and companies.",
    "points": [
        {
            "name": "Reporting to Authorities",
            "steps": [
                {
                    "step": "5",
                    "title": "Contact law-enforcement bureaus that deal with scams.",
                    "subtitle": " Your local Attorney General’s office and the Federal Bureau of Investigation are the law-enforcement agencies that deal with most scams. Call their general number or contact them online about scam calls that you have received.",
                    "sub-points": [
                        "The website to contact the FBI at is .",
                        "Your Attorney General's contact information can be found by doing an online search that includes the name of your state and the words \"attorney general contact information.\""
                    ]
                },
                {
                    "step": "5",
                    "title": "Contact law-enforcement bureaus that deal with scams.",
                    "subtitle": " Your local Attorney General’s office and the Federal Bureau of Investigation are the law-enforcement agencies that deal with most scams. Call their general number or contact them online about scam calls that you have received.",
                    "sub-points": [
                        "The website to contact the FBI at is .",
                        "Your Attorney General's contact information can be found by doing an online search that includes the name of your state and the words \"attorney general contact information.\""
                    ]
                }
            ]
        },
        {
            "name": "Reporting to Agencies and Companies",
            "steps": [
                {
                    "step": "4",
                    "title": "Make a report to your telephone provider to get scam calls blocked.",
                    "subtitle": " If you keep getting scam calls, it's a good idea to let the phone company know that the number is being used for illegal activity. Some providers can block the scammer's number and may be able to work with the FCC to stop the scam from continuing with other people.",
                    "sub-points": [
                        "Call the general customer service number of your phone company and tell the operator that you are trying to report a number being used for a scam."
                    ]
                }
            ]
        },
        {
            "name": "Identifying Scam Calls",
            "steps": [
                {
                    "step": "9",
                    "title": "Trust your instincts.",
                    "subtitle": " Often scammers rely on making people feel guilty for suspecting a scam. However, if you get a call and something just doesn't feel right, hang up the phone. Overall, it's just always better to be safe than sorry.",
                    "sub-points": [
                        "If you are suspicious of a call from a company but you're scared that the caller might be telling the truth, simply tell them you are going hang up the phone and call the company yourself. If the caller is above board, they should have no problem with you doing this."
                    ]
                }
            ]
        },
        {
            "name": "Blocking Scam Calls",
            "steps": []
        }
    ]
}