{
    "link": "https://www.wikihow.com/Get-Ascendant-Shards",
    "article": "How to Farm Ascendant Shards: Fastest Methods in Destiny 2",
    "intro": "",
    "points": [
        {
            "name": "Farming Ascendant Shards ",
            "steps": [
                {
                    "step": "6",
                    "title": "Win the Trials of Osiris games.",
                    "subtitle": " The Trials of Osiris is a higher-stakes variant of Crucible, with PvP (player-versus-player) matches that yield some of the game’s best weapons and armor. If you win 7 matches in a row (with no losses whatsoever), you’ll get an Ascendant Shard from the Lighthouse Chest.",
                    "sub-points": [
                        "None of the recommended steps in this guide will net a ton of shards right away—but by continually doing these things over time, you’ll gain all the shards you need!"
                    ]
                }
            ]
        },
        {
            "name": "What are ascendant shards?",
            "steps": [
                {
                    "step": "None",
                    "title": "Ascendant shards are a type of material in .",
                    "subtitle": " In the first  game, Ascendant Shards were used during Year 1 but eventually phased out. In , they returned as an exotic material typically used in high-quality crafting. Since season 22, players can have no more than 30 Ascendant Shards on their accounts—and can’t have any on their Postmaster.",
                    "sub-points": [
                        "That means players can’t stockpile as many Ascendant Shards as they could in earlier seasons of the game."
                    ]
                }
            ]
        },
        {
            "name": "Why are ascendant shards useful?",
            "steps": [
                {
                    "step": "None",
                    "title": "Ascendant shards are used to masterwork Legendary and Exotic armor.",
                    "subtitle": " Exotic armor pieces require 3 shards to successfully masterwork, while legendary armor pieces only need 1. Since Ascendant Shards are rare, it’s a good idea to think carefully about the best ways to spend them—and use them sparingly! You can also use them to:",
                    "sub-points": [
                        "Purchase exotic weapons from the Tower’s Lost Lights kiosk.",
                        "Focus exotic gear with Rahool (in the Tower)."
                    ]
                },
                {
                    "step": "None",
                    "title": "Ascendant shards are used to masterwork Legendary and Exotic armor.",
                    "subtitle": " Exotic armor pieces require 3 shards to successfully masterwork, while legendary armor pieces only need 1. Since Ascendant Shards are rare, it’s a good idea to think carefully about the best ways to spend them—and use them sparingly! You can also use them to:",
                    "sub-points": [
                        "Purchase exotic weapons from the Tower’s Lost Lights kiosk.",
                        "Focus exotic gear with Rahool (in the Tower)."
                    ]
                }
            ]
        }
    ]
}